{
  "05zEpbSqcs9E0rcnCJWyZ9OgdH0MLby": {
    "ingredients": [
      "12 egg whites",
      "12 egg yolks",
      "1 1/2 cups sugar",
      "3/4 cup rye whiskey",
      "12 egg whites",
      "3/4 cup brandy",
      "1/2 cup rum",
      "1 to 2 cups heavy cream, lightly whipped",
      "Garnish: ground nutmeg"
    ],
    "picture_link": null,
    "instructions": "Beat the egg whites until stiff, gradually adding in 3/4 cup sugar. Set aside. Beat the egg yolks until they are thick and pale and add the other 3/4 cup sugar and stir in rye whiskey. Blend well. Fold the egg white mixture into the yolk mixture and add the brandy and the rum. Beat the mixture well. To serve, fold the lightly whipped heavy cream into the eggnog. (If a thinner mixture is desired, add the heavy cream unwhipped.) Sprinkle the top of the eggnog with the nutmeg to taste.\nBeat the egg whites until stiff, gradually adding in 3/4 cup sugar. Set aside. Beat the egg yolks until they are thick and pale and add the other 3/4 cup sugar and stir in rye whiskey. Blend well. Fold the egg white mixture into the yolk mixture and add the brandy and the rum. Beat the mixture well. To serve, fold the lightly whipped heavy cream into the eggnog. (If a thinner mixture is desired, add the heavy cream unwhipped.) Sprinkle the top of the eggnog with the nutmeg to taste.",
    "title": "Christmas Eggnog "
  },
  "mF5SZmoqxF4WtIlhLRvzuKk.z6s7P2S": {
    "ingredients": [
      "18 fresh chestnuts",
      "2 1/2 pounds veal stew meat, cut into 2x1-inch pieces",
      "4 tablespoons olive oil",
      "1 1/2 cups chopped onion",
      "1 1/2 tablespoons chopped garlic",
      "1 bay leaf",
      "2 1/2 cups canned low-salt chicken broth",
      "3/4 cup dry white wine",
      "6 medium carrots, peeled, cut into 1-inch pieces",
      "3 tablespoons chopped fresh sage"
    ],
    "picture_link": null,
    "instructions": "Preheat oven to 400°F. Using small sharp knife, cut an X in each chestnut. Place in roasting pan. Bake until tender and shells loosen, about 35 minutes. Cool slightly. Remove hard shell and papery brown skin from each nut. Set nuts aside. Pat veal pieces dry with paper towels. Sprinkle with salt and pepper. Heat 2 tablespoons oil in heavy large pot over medium-high heat. Working in batches, add veal to pot and cook until brown on all sides, about 10 minutes. Using slotted spoon, transfer veal to large bowl. Heat 2 tablespoons oil in same pot. Add onion, garlic and bay leaf. Reduce heat to medium; cover and cook until onion is tender, stirring occasionally, about 5 minutes. Stir in broth and wine. Add veal and any accumulated juices from bowl. Bring to boil. Reduce heat. Cover; simmer 45 minutes, stirring occasionally. Add carrots to stew. Cover and cook until carrots are almost tender, about 25 minutes. Uncover and cook until meat is very tender and liquid is reduced to thin sauce consistency, about 25 minutes longer. Stir in nuts and sage. Simmer until nuts are heated through, about 3 minutes. Discard bay leaf. Transfer ragout to bowl.\nPreheat oven to 400°F. Using small sharp knife, cut an X in each chestnut. Place in roasting pan. Bake until tender and shells loosen, about 35 minutes. Cool slightly. Remove hard shell and papery brown skin from each nut. Set nuts aside.\nPat veal pieces dry with paper towels. Sprinkle with salt and pepper. Heat 2 tablespoons oil in heavy large pot over medium-high heat. Working in batches, add veal to pot and cook until brown on all sides, about 10 minutes. Using slotted spoon, transfer veal to large bowl.\nHeat 2 tablespoons oil in same pot. Add onion, garlic and bay leaf. Reduce heat to medium; cover and cook until onion is tender, stirring occasionally, about 5 minutes. Stir in broth and wine. Add veal and any accumulated juices from bowl. Bring to boil. Reduce heat. Cover; simmer 45 minutes, stirring occasionally.\nAdd carrots to stew. Cover and cook until carrots are almost tender, about 25 minutes. Uncover and cook until meat is very tender and liquid is reduced to thin sauce consistency, about 25 minutes longer. Stir in nuts and sage. Simmer until nuts are heated through, about 3 minutes. Discard bay leaf. Transfer ragout to bowl.",
    "title": "Veal, Carrot and Chestnut Ragoût "
  },
  "oQV5D7cVbCFwmrDs3pBUv2y.AG0WV26": {
    "ingredients": [
      "2 tablespoons unsalted butter, softened",
      "4 or 5 slices brioche, or good quality white bread (I like Pepperidge Farm), 1/4 inch thick, crusts removed",
      "3 extra-large eggs",
      "2 extra-large egg yolks",
      "1/4 cup brown sugar",
      "1 1/2 cups heavy cream",
      "1 1/4 cups whole milk",
      "1 teaspoon pure vanilla extract",
      "1/2 teaspoon ground cinnamon",
      "1/4 teaspoon freshly grated nutmeg",
      "1/4 teaspoon kosher salt",
      "3/4 cup chopped bittersweet chocolate",
      "1 tablespoon granulated sugar, for caramelizing the top"
    ],
    "picture_link": "3xjktRst3I5lDZ2Z5kTOtqQyzZFFN9u",
    "instructions": "Preheat the oven to 350°F. Spread the softened butter on one side of the brioche. Cut each slice in half on the diagonal and then again into quarters. Whisk together the eggs, egg yolks, and brown sugar in a large bowl. Add the cream, milk, vanilla, cinnamon, nutmeg, and salt, whisking to combine well. Sprinkle the chocolate over the bottom of a 9-by-9-inch (or equivalent) baking dish. Arrange the brioche, buttered side up, with slices overlapping just slightly, on the chocolate (there should be just a single layer of bread). Pour the custard over the bread, pressing down with your fingers to make sure the bread soaks it up. Place the bread pudding in a roasting pan, and pour warm water into the pan to come halfway up the sides of the pudding dish. Bake about 1 hour and 15 minutes, until the custard is set and the bread puffs up slightly. The pudding will be springy to the touch. Let the bread pudding cool at least 10 minutes. If you have a kitchen blowtorch, sprinkle the sugar over the top, and torch to brown and caramelize. You could run the pudding under the broiler to caramelize if you don’t have a torch, but be careful not to curdle the custard underneath. Serve the bread pudding from the baking dish at the table, using a big spoon.\nPreheat the oven to 350°F.\nSpread the softened butter on one side of the brioche. Cut each slice in half on the diagonal and then again into quarters.\nWhisk together the eggs, egg yolks, and brown sugar in a large bowl. Add the cream, milk, vanilla, cinnamon, nutmeg, and salt, whisking to combine well.\nSprinkle the chocolate over the bottom of a 9-by-9-inch (or equivalent) baking dish. Arrange the brioche, buttered side up, with slices overlapping just slightly, on the chocolate (there should be just a single layer of bread). Pour the custard over the bread, pressing down with your fingers to make sure the bread soaks it up. Place the bread pudding in a roasting pan, and pour warm water into the pan to come halfway up the sides of the pudding dish. Bake about 1 hour and 15 minutes, until the custard is set and the bread puffs up slightly. The pudding will be springy to the touch.\nLet the bread pudding cool at least 10 minutes.\nIf you have a kitchen blowtorch, sprinkle the sugar over the top, and torch to brown and caramelize. You could run the pudding under the broiler to caramelize if you don’t have a torch, but be careful not to curdle the custard underneath.\nServe the bread pudding from the baking dish at the table, using a big spoon.",
    "title": "Caramelized Bread Pudding with Chocolate and Cinnamon "
  },
  "Z9seBJWaB5NkSp4DQHDnCAUBTwov/1u": {
    "ingredients": [
      "3/4 pound Stilton, crumbled (about 3 cups) and softened",
      "6 ounces cream cheese, softened",
      "2 to 3 tablespoons drained green peppercorns packed in brine",
      "1/4 cup medium-dry Sherry, or to taste"
    ],
    "picture_link": null,
    "instructions": "In a food processor blend the Stilton, the cream cheese, the peppercorns to taste, the Sherry, and salt and pepper to taste until the mixture is smooth and transfer the spread to crocks or ramekins. The spread keeps, covered and chilled, for 1 week. Serve the spread with crackers.\nIn a food processor blend the Stilton, the cream cheese, the peppercorns to taste, the Sherry, and salt and pepper to taste until the mixture is smooth and transfer the spread to crocks or ramekins. The spread keeps, covered and chilled, for 1 week. Serve the spread with crackers.",
    "title": "Sherried Stilton and Green Peppercorn Spread "
  },
  "bB3GxoAplVZeoX3fzWNWyeECtQFxw6G": {
    "ingredients": [
      "2 cups (about 9 1/2 ounces) whole almonds, toasted",
      "1 cup sugar",
      "1/4 teaspoon ground cinnamon",
      "1/8 teaspoon salt",
      "1 large egg",
      "2 large egg white",
      "1/4 teaspoon almond extract",
      "3/4 cup finely chopped bittersweet (not unsweetened) or semisweet chocolate"
    ],
    "picture_link": null,
    "instructions": "Position rack in center of oven and preheat to 350°F. Line 2 heavy large baking sheets with foil. Butter foil and dust with flour. Finely grind almonds, sugar, cinnamon and salt in processor. Add egg, egg white and almond extract and process until mixture holds together. Transfer to bowl. Stir in chocolate. Using moistened hands, roll mixture into 1-inch balls and place on prepared sheets. Flatten to 1/3-inch thick rounds. Bake macaroons until tops puff and centers are still soft, about 12 minutes. Transfer to rack and cool completely. Store in airtight container at room temperature. (Can be prepared 3 days ahead.)\nPosition rack in center of oven and preheat to 350°F. Line 2 heavy large baking sheets with foil. Butter foil and dust with flour. Finely grind almonds, sugar, cinnamon and salt in processor. Add egg, egg white and almond extract and process until mixture holds together. Transfer to bowl. Stir in chocolate.\nUsing moistened hands, roll mixture into 1-inch balls and place on prepared sheets. Flatten to 1/3-inch thick rounds. Bake macaroons until tops puff and centers are still soft, about 12 minutes. Transfer to rack and cool completely. Store in airtight container at room temperature. (Can be prepared 3 days ahead.)",
    "title": "Almond-Chocolate Macaroons "
  },
  "FHQAJvovVtPyKWlzgFEHgSUJsCM2Tjq": {
    "ingredients": [
      "2 tablespoons butter",
      "2 tablespoons flour",
      "1 1/4 cups milk, heated",
      "Salt",
      "Freshly ground pepper"
    ],
    "picture_link": "cvv25l1DWlsVF/1TPnkpMI8tLdIMGem",
    "instructions": "Melt the butter in a heavy-bottomed saucepan. Stir in the flour and cook, stirring constantly, until the paste cooks and bubbles a bit, but don't let it brown — about 2 minutes. Add the hot milk, continuing to stir as the sauce thickens. Bring it to a boil. Add salt and pepper to taste, lower the heat, and cook, stirring for 2 to 3 minutes more. Remove from the heat. To cool this sauce for later use, cover it with wax paper or pour a film of milk over it to prevent a skin from forming.\nMelt the butter in a heavy-bottomed saucepan. Stir in the flour and cook, stirring constantly, until the paste cooks and bubbles a bit, but don't let it brown — about 2 minutes. Add the hot milk, continuing to stir as the sauce thickens. Bring it to a boil. Add salt and pepper to taste, lower the heat, and cook, stirring for 2 to 3 minutes more. Remove from the heat. To cool this sauce for later use, cover it with wax paper or pour a film of milk over it to prevent a skin from forming.\nCheese Sauce. Stir in 1/2 cup grated Cheddar cheese during the last 2 minutes of cooking, along with a pinch of cayenne pepper.\nStir in 1/2 cup grated Cheddar cheese during the last 2 minutes of cooking, along with a pinch of cayenne pepper.\nHow hot should the milk be? Warm the milk on low heat just until little bubbles begin to form at the edges. Then remove from heat.\nWarm the milk on low heat just until little bubbles begin to form at the edges. Then remove from heat.",
    "title": "White Sauce or Bechamel Sauce "
  },
  "Jt7RKsNPY7/1QrOjuPEomP/s6mD2AvO": {
    "ingredients": [
      "1/2 teaspoon finely grated fresh lemon zest",
      "1 1/2 tablespoons fresh lemon juice",
      "1/3 cup extra-virgin olive oil",
      "1/4 cup pitted Kalamata olives (1 1/4 oz), cut into slivers",
      "3 tablespoons finely chopped fresh oregano plus 6 large sprigs",
      "1 (3 1/4- to 3 1/2-lb) cleaned whole Spanish mackerel or bluefish (with head and tail)",
      "2 tablespoons vegetable oil",
      "6 (1/4-inch-thick) lemon slices",
      "Special equipment: a 22-inch grill; kitchen string"
    ],
    "picture_link": "g2GPWB.pUjfUxA36R/G8tLTDbtlFtGS",
    "instructions": "Whisk together zest, lemon juice, and salt and pepper to taste, then add olive oil in a stream, whisking until combined well. Whisk in olives and chopped oregano. Make 1-inch-long slits at 2-inch intervals down middle of fish on both sides with a sharp paring knife, then brush fish all over with vegetable oil and season with salt and pepper. Season fish cavity with salt and pepper, then evenly distribute 3 lemon rounds and 3 oregano sprigs in cavity. Close cavity, then evenly arrange remaining 3 lemon rounds and 3 oregano sprigs on top of fish and tie fish closed with string at 2-inch intervals, securing lemon slices and oregano sprigs to fish. Prepare grill for cooking. If using a charcoal grill, open vents on bottom of grill, then light charcoal. Charcoal fire is medium-hot when you can hold your hand 5 inches above rack for 3 to 4 seconds. If using a gas grill, preheat burners on high, covered, 10 minutes, then reduce heat to moderate. Grill fish on lightly oiled grill rack, covered only if using gas grill, 15 minutes. Turn fish over using a metal spatula and tongs, then grill until just cooked through, about 15 minutes more. Transfer fish to a large platter using 2 metal spatulas, then cut and discard string. Serve fish with sauce.\nWhisk together zest, lemon juice, and salt and pepper to taste, then add olive oil in a stream, whisking until combined well. Whisk in olives and chopped oregano.\nMake 1-inch-long slits at 2-inch intervals down middle of fish on both sides with a sharp paring knife, then brush fish all over with vegetable oil and season with salt and pepper. Season fish cavity with salt and pepper, then evenly distribute 3 lemon rounds and 3 oregano sprigs in cavity. Close cavity, then evenly arrange remaining 3 lemon rounds and 3 oregano sprigs on top of fish and tie fish closed with string at 2-inch intervals, securing lemon slices and oregano sprigs to fish.\nPrepare grill for cooking. If using a charcoal grill, open vents on bottom of grill, then light charcoal. Charcoal fire is medium-hot when you can hold your hand 5 inches above rack for 3 to 4 seconds. If using a gas grill, preheat burners on high, covered, 10 minutes, then reduce heat to moderate.\nGrill fish on lightly oiled grill rack, covered only if using gas grill, 15 minutes. Turn fish over using a metal spatula and tongs, then grill until just cooked through, about 15 minutes more.\nTransfer fish to a large platter using 2 metal spatulas, then cut and discard string. Serve fish with sauce.",
    "title": "Grilled Whole Mackerel with Lemon, Oregano, and Olives "
  },
  "1rBWKEw7vZjXA97NmHGS3VHq1iVX9c.": {
    "ingredients": [
      "2 garlic cloves, finely chopped",
      "2 teaspoons finely chopped peeled fresh ginger",
      "1 tablespoon vegetable oil",
      "1 teaspoon mustard seeds",
      "3/4 cup dried apricots (6 oz), finely chopped",
      "1/3 cup dried currants (1 1/2 oz)",
      "3/4 cup water",
      "1/3 cup red-wine vinegar",
      "1/4 cup sugar",
      "3/4 teaspoon salt"
    ],
    "picture_link": null,
    "instructions": "Cook garlic and ginger in oil in a 1- to 1 1/2-quart heavy saucepan over moderate heat, stirring, until golden, 1 to 2 minutes. Add mustard seeds and cook, stirring, until fragrant, about 1 minute. Add remaining ingredients and simmer, partially covered, stirring occasionally, until almost all liquid is absorbed, about 20 minutes (chutney should be moist). Cool to room temperature.\nCook garlic and ginger in oil in a 1- to 1 1/2-quart heavy saucepan over moderate heat, stirring, until golden, 1 to 2 minutes. Add mustard seeds and cook, stirring, until fragrant, about 1 minute. Add remaining ingredients and simmer, partially covered, stirring occasionally, until almost all liquid is absorbed, about 20 minutes (chutney should be moist). Cool to room temperature.",
    "title": "Apricot Chutney "
  },
  "agTMHTysNlAOyMM3zQlXVu4qbJrLmqa": {
    "ingredients": [
      "2 tablespoons (1/4 stick) butter",
      "1/4 cup olive oil",
      "2 large garlic cloves, pressed",
      "4 French bread slices, cut into 3/4-inch cubes"
    ],
    "picture_link": null,
    "instructions": "Preheat oven to 350°F. Melt 2 tablespoons butter with olive oil and garlic in small saucepan. Place bread cubes on baking sheet. Pour butter mixture over and toss well. Bake until bread cubes are golden brown and crisp, about 20 minutes. Season with salt and pepper. Cool completely. (Croutons can be prepared 1 day ahead. Store at room temperature in airtight container.)\nPreheat oven to 350°F. Melt 2 tablespoons butter with olive oil and garlic in small saucepan. Place bread cubes on baking sheet. Pour butter mixture over and toss well. Bake until bread cubes are golden brown and crisp, about 20 minutes. Season with salt and pepper. Cool completely. (Croutons can be prepared 1 day ahead. Store at room temperature in airtight container.)",
    "title": "Garlic Croutons "
  },
  "Y..dFCvcwNW4gdogZ3DqLUETR2x.uA2": {
    "ingredients": [
      "1 recipe pâte à chou",
      "About 1 cup pastry cream",
      "1/2 cup heavy cream",
      "1 recipe chocolate sauce",
      "Assorted candy decorations such as M&M;'s, Red Hots, licorice balls, and silver dragées",
      "Special equipment: Large pastry bag with 1/2-inch and 1/4-inch plain tips, clear tape, 18-inch-tall Styrofoam cone (available at floral shops and craft stores), parchment paper, cake-decorating turntable (optional), about 70 toothpicks, thimble, cloth leaves (available at floral shops and craft stores)"
    ],
    "picture_link": "/CJLlvthN5lJcsScHGU7CKrxbGS5ElW",
    "instructions": "Make cream puffs Preheat oven to 425°F. and butter and flour 2 baking sheets. Spoon pâte à chou into a large pastry bag fitted with a 1/2-inch plain tip and pipe about 55 mounds onto baking sheets, each about 1 1/2 inches in diameter, leaving 1 1/2 inches between mounds. With a finger dipped in water gently smooth pointed tip of each mound to round puffs. Bake puffs in upper third of oven 10 minutes, switching position of sheets in oven halfway through baking if necessary. Reduce temperature to 400°F. and bake puffs 20 minutes more, or until puffed and golden. Let puffs stand in turned-off oven 30 minutes. Transfer puffs to racks to cool. With a skewer poke a 1/4-inch hole in bottom of each puff. Puffs may be made 2 days ahead and kept in an airtight container. Recrisp puffs in 400°F. oven 5 minutes and cool before filling.\nPreheat oven to 425°F. and butter and flour 2 baking sheets. Spoon pâte à chou into a large pastry bag fitted with a 1/2-inch plain tip and pipe about 55 mounds onto baking sheets, each about 1 1/2 inches in diameter, leaving 1 1/2 inches between mounds. With a finger dipped in water gently smooth pointed tip of each mound to round puffs. Bake puffs in upper third of oven 10 minutes, switching position of sheets in oven halfway through baking if necessary. Reduce temperature to 400°F. and bake puffs 20 minutes more, or until puffed and golden. Let puffs stand in turned-off oven 30 minutes. Transfer puffs to racks to cool. With a skewer poke a 1/4-inch hole in bottom of each puff. Puffs may be made 2 days ahead and kept in an airtight container. Recrisp puffs in 400°F. oven 5 minutes and cool before filling.\nMake filling In bowl of a standing electric mixer beat pastry cream until just smooth and soft enough to fold in heavy cream (do not overbeat). In a chilled bowl with cleaned beaters beat heavy cream until it holds soft peaks. Fold whipped cream into pastry cream. Chill filling, covered, about 1 hour, or until cold.\nIn bowl of a standing electric mixer beat pastry cream until just smooth and soft enough to fold in heavy cream (do not overbeat). In a chilled bowl with cleaned beaters beat heavy cream until it holds soft peaks. Fold whipped cream into pastry cream. Chill filling, covered, about 1 hour, or until cold.\nFill cream puffs Transfer filling to a large pastry bag fitted with a 1/4-inch plain top and barely fill each puff (do not overfill), putting filled puffs in a shallow baking pan.\nTransfer filling to a large pastry bag fitted with a 1/4-inch plain top and barely fill each puff (do not overfill), putting filled puffs in a shallow baking pan.\nAssemble croquembouche Using tape, cover cone with parchment paper. Place cone on turntable if using. Line a tray with wax paper. Working with 1 cream puff at a time, dip bottom in chocolate sauce, leaving top 1/3 inch uncoated and letting excess drip off, then arrange 1 ring of puffs around base of cone, placing as closely together as possible. Insert toothpick through each puff into cone to attach puff to cone, leaving end of toothpick sticking out (you'll push it in later with thimble). Attach second ring of puffs above first, again packing tightly and staggering so puffs in second ring are not directly above puffs in first ring. Continue in same manner to dip and attach remaining puffs. Finish covering cone with 1 puff attached to top of cone. Using thimble, push in toothpicks until not visible. Decorate by pushing candies and leaves into gaps between doughnut holes. To serve croquembouche, dismantle, 1 puff at a time.\nUsing tape, cover cone with parchment paper. Place cone on turntable if using.\nLine a tray with wax paper. Working with 1 cream puff at a time, dip bottom in chocolate sauce, leaving top 1/3 inch uncoated and letting excess drip off, then arrange 1 ring of puffs around base of cone, placing as closely together as possible. Insert toothpick through each puff into cone to attach puff to cone, leaving end of toothpick sticking out (you'll push it in later with thimble).\nAttach second ring of puffs above first, again packing tightly and staggering so puffs in second ring are not directly above puffs in first ring. Continue in same manner to dip and attach remaining puffs. Finish covering cone with 1 puff attached to top of cone.\nUsing thimble, push in toothpicks until not visible.\nDecorate by pushing candies and leaves into gaps between doughnut holes.\nTo serve croquembouche, dismantle, 1 puff at a time.",
    "title": "Christmas Croquembouche "
  },
  "wAybSELYww/.RDBrZyskjgx0XueW1Mq": {
    "ingredients": [
      "2 1/2 cups all purpose flour",
      "1/4 cup unsweetened cocoa powder",
      "1/2 teaspoon baking powder",
      "1/2 teaspoon salt",
      "1/4 teaspoon baking soda",
      "1/2 teaspoon ground cinnamon (optional)",
      "3 ounces bittersweet chocolate, chopped",
      "1 cup (2 sticks) butter, room temperature",
      "1 1/3 cups sugar",
      "1 large egg",
      "1/2 teaspoon vanilla extract",
      "Sprinkles or other sugar decorations (optional)",
      "Royal Icing (optional)"
    ],
    "picture_link": "8BPZCt6LObhShBQh7VBSWMfqOe4QFSW",
    "instructions": "Sift first 5 ingredients and cinnamon, if desired, into medium bowl. Stir chocolate in metal bowl set over saucepan of simmering water until melted and smooth. Set aside. Using electric mixer, beat butter in large bowl at medium speed until smooth and creamy, about 2 minutes. Add sugar and beat until mixture is pale and fluffy, about 2 minutes. Add egg; beat until well blended, about 1 minute. Reduce speed to low and beat in vanilla and chocolate. Add flour mixture and beat on low speed just to blend. Gather dough into ball; divide in half. Form each half into ball and flatten into disk. Wrap disks separately in plastic and chill until firm, at least 4 hours. DO AHEAD: Can be made 2 days ahead. Keep chilled. Let stand at room temperature 30 minutes before rolling out. Position rack in center of oven; preheat to 350°F. Line 2 baking sheets with parchment paper. Working with 1 disk at a time, roll out dough between 2 sheets of waxed paper to 1/8-inch thickness for smaller (2-inch) cookies and 1/4-inch thickness for larger (3- to 4-inch) cookies. Using waxed paper prevents you from adding too much flour, which will make the cookies tough. Using decorative cookie cutters, cut out cookies. Cold dough is much easier to work with. If it gets warm as you're cutting out the cookies, place the dough—waxed paper and all—in the freezer for about 5 minutes. Use an offset spatula to peel away the excess dough and transfer the cookies to parchment-lined baking sheets, spacing 1 inch apart. Gather scraps, roll out dough, and cut more cookies, repeating until all dough is used. If not icing cookies, decorate with sprinkles or other sugar toppings, if desired. Bake 1 sheet at a time until cookies are firm on top and slightly darker around edges, about 9 minutes for smaller cookies and up to 12 minutes for larger cookies. Line baking sheets with fresh parchment as needed. Cool completely on rack. Decorate cookies with royal icing if desired. DO AHEAD: Cookies can be made 4 days ahead. Store between sheets of waxed paper in airtight containers.\nSift first 5 ingredients and cinnamon, if desired, into medium bowl. Stir chocolate in metal bowl set over saucepan of simmering water until melted and smooth. Set aside. Using electric mixer, beat butter in large bowl at medium speed until smooth and creamy, about 2 minutes. Add sugar and beat until mixture is pale and fluffy, about 2 minutes. Add egg; beat until well blended, about 1 minute. Reduce speed to low and beat in vanilla and chocolate. Add flour mixture and beat on low speed just to blend. Gather dough into ball; divide in half. Form each half into ball and flatten into disk. Wrap disks separately in plastic and chill until firm, at least 4 hours. DO AHEAD: Can be made 2 days ahead. Keep chilled. Let stand at room temperature 30 minutes before rolling out.\nPosition rack in center of oven; preheat to 350°F. Line 2 baking sheets with parchment paper.\nWorking with 1 disk at a time, roll out dough between 2 sheets of waxed paper to 1/8-inch thickness for smaller (2-inch) cookies and 1/4-inch thickness for larger (3- to 4-inch) cookies. Using waxed paper prevents you from adding too much flour, which will make the cookies tough.\nUsing decorative cookie cutters, cut out cookies. Cold dough is much easier to work with. If it gets warm as you're cutting out the cookies, place the dough—waxed paper and all—in the freezer for about 5 minutes.\nUse an offset spatula to peel away the excess dough and transfer the cookies to parchment-lined baking sheets, spacing 1 inch apart. Gather scraps, roll out dough, and cut more cookies, repeating until all dough is used. If not icing cookies, decorate with sprinkles or other sugar toppings, if desired.\nBake 1 sheet at a time until cookies are firm on top and slightly darker around edges, about 9 minutes for smaller cookies and up to 12 minutes for larger cookies. Line baking sheets with fresh parchment as needed. Cool completely on rack. Decorate cookies with royal icing if desired. DO AHEAD: Cookies can be made 4 days ahead. Store between sheets of waxed paper in airtight containers.",
    "title": "Chocolate Roll-Out Cookies "
  },
  "JnAmtoxgN/vW8NPycwzFW/bCYQH0vXO": {
    "ingredients": [
      "2 tablespoons brewed coffee",
      "1 ounce semisweet chocolate, chopped",
      "1/4 teaspoon vanilla",
      "1/8 teaspoon cornstarch",
      "Pinch cinnamon"
    ],
    "picture_link": null,
    "instructions": "Combine all ingredients in a small saucepan and cook, whisking, over moderately low heat until smooth and thickened, about 2 minutes. Remove from heat and cool to warm before serving.\nCombine all ingredients in a small saucepan and cook, whisking, over moderately low heat until smooth and thickened, about 2 minutes. Remove from heat and cool to warm before serving.",
    "title": "Mocha Sauce "
  },
  ".iwUfWzkQDtbd5uTDvXyM4A4oluMBCO": {
    "ingredients": [
      "1 cup all purpose flour",
      "1/2 teaspoon ground cinnamon",
      "1/2 teaspoon baking soda",
      "1/4 teaspoon salt",
      "1/2 cup butter, room temperature",
      "3/4 cup (packed) golden brown sugar",
      "1 1/2 teaspoons vanilla extract",
      "1/4 teaspoon almond extract",
      "1 large egg",
      "1 cup coarsely chopped pecans",
      "6 ounces semisweet chocolate, coarsely chopped"
    ],
    "picture_link": "AbHTAlmbH0l7mrHflBvzqlxHiXayALe",
    "instructions": "Preheat oven to 350°F. Mix first 4 ingredients in medium bowl. Using electric mixer, beat butter, brown sugar, vanilla and almond extract in large bowl until blended. Add egg; beat until fluffy. Beat in flour mixture. Stir pecans and chocolate pieces into dough. Using 2 tablespoonfuls dough for each cookie, drop dough mounds onto ungreased baking sheets, spacing 2 inches apart. Press tops slightly to flatten. Bake cookies until edges begin to brown but centers are still soft, about 13 minutes. Let cool on sheets 2 minutes. Transfer cookies to racks; cool completely. (Can be made 2 days ahead. Store airtight at room temperature.)\nPreheat oven to 350°F. Mix first 4 ingredients in medium bowl. Using electric mixer, beat butter, brown sugar, vanilla and almond extract in large bowl until blended. Add egg; beat until fluffy. Beat in flour mixture. Stir pecans and chocolate pieces into dough.\nUsing 2 tablespoonfuls dough for each cookie, drop dough mounds onto ungreased baking sheets, spacing 2 inches apart. Press tops slightly to flatten.\nBake cookies until edges begin to brown but centers are still soft, about 13 minutes. Let cool on sheets 2 minutes. Transfer cookies to racks; cool completely. (Can be made 2 days ahead. Store airtight at room temperature.)",
    "title": "Chocolate Chunk and Pecan Cookies "
  },
  "2RAoUiVRmYrenvEQU2RKVZWJ9Xmxmo6": {
    "ingredients": [
      "1 1/2 teaspoons cumin seeds",
      "3/4 cup ketchup",
      "1 1/2 teaspoons chopped canned chipotle chilies plus 1 tablespoon spicy tomato sauce reserved from can",
      "1 1/2 tablespoons fresh lime juice",
      "1 tablespoon tequila"
    ],
    "picture_link": null,
    "instructions": "Stir cumin seeds in heavy small saucepan over medium heat until fragrant and seeds darken, about 1 minute. Transfer to plate and cool. Grind seeds in spice grinder or in mortar with pestle. Return cumin to same saucepan. Whisk in ketchup, chipotle chilies with 1 tablespoon spicy tomato sauce, lime juice and tequila. Simmer over medium-low heat until ketchup thickens slightly, stirring occasionally, about 5 minutes. Serve warm or at room temperature. (Can be made 1 week ahead. Cover and chill.)\nStir cumin seeds in heavy small saucepan over medium heat until fragrant and seeds darken, about 1 minute. Transfer to plate and cool. Grind seeds in spice grinder or in mortar with pestle.\nReturn cumin to same saucepan. Whisk in ketchup, chipotle chilies with 1 tablespoon spicy tomato sauce, lime juice and tequila. Simmer over medium-low heat until ketchup thickens slightly, stirring occasionally, about 5 minutes. Serve warm or at room temperature. (Can be made 1 week ahead. Cover and chill.)",
    "title": "Cumin-Chipotle Ketchup "
  },
  "tZyoBQtCH9yXlhi6P5MvIizmh0Eb62a": {
    "ingredients": [
      "1 ounce Scotch whiskey",
      "1/2 ounce sweet vermouth",
      "1/2 ounce dry vermouth",
      "Dash Benedictine",
      "3 or 4 ice cubes"
    ],
    "picture_link": null,
    "instructions": "Combine all ingredients in a mixing glass and stir well. Strain into a cocktail glass.\nCombine all ingredients in a mixing glass and stir well. Strain into a cocktail glass.",
    "title": "Bobby Burns "
  },
  "z26qlU48ZmhyEvus3NzvTn1vEmjq8Kq": {
    "ingredients": [
      "16 baby red-skinned potatoes (about 1 1/4 pounds)",
      "2 tablespoons (1/4 stick) butter",
      "2 tablespoons chopped Italian parsley"
    ],
    "picture_link": null,
    "instructions": "Using vegetable peeler, remove a narrow strip of peel from around middle of each potato. Cook potatoes in large pot of boiling salted water until just tender, about 15 minutes. Drain. (Can be prepared 1 day ahead. Cover and refrigerate.) Melt butter in large nonstick skillet over medium-high heat. Add potatoes and sauté until crisp and golden, about 7 minutes. Season with salt and pepper. Transfer to bowl. Sprinkle with parsley.\nUsing vegetable peeler, remove a narrow strip of peel from around middle of each potato. Cook potatoes in large pot of boiling salted water until just tender, about 15 minutes. Drain. (Can be prepared 1 day ahead. Cover and refrigerate.)\nMelt butter in large nonstick skillet over medium-high heat. Add potatoes and sauté until crisp and golden, about 7 minutes. Season with salt and pepper. Transfer to bowl. Sprinkle with parsley.",
    "title": "Sauteed New Potatoes with Parsley "
  },
  "F90CEW4q0ddU7FarDR7WMsqupZ0FV0S": {
    "ingredients": [
      "2 cups all purpose flour",
      "1 tablespoon sugar",
      "3/4 teaspoon salt",
      "10 tablespoons (1 1/4 sticks) chilled unsalted butter, cut into 1/2-inch cubes",
      "5 tablespoons (about) chilled orange juice, divided",
      "1 large egg white, beaten to blend",
      "1 1/2 cups (packed) golden brown sugar",
      "3/4 cup (1 1/2 sticks) unsalted butter, diced",
      "3 Albemarle Pippin apples or Fuji apples (1 1/2 to 1 3/4 pounds), peeled,quartered, cored",
      "3/4 cup sugar",
      "2 tablespoons all purpose flour",
      "1/2 teaspoon salt",
      "4 large eggs",
      "1/4 cup light corn syrup",
      "2 teaspoons vanilla extract",
      "1 1/2 cup coursely chopped pecans, toasted"
    ],
    "picture_link": "mTrDtqVn9nsFRBqL1gylYgr3/VL47Bu",
    "instructions": "For crust: Blend flour, sugar, and salt in processor 5 seconds. Add butter. Using on/off turns, blend until butter is reduced to small pea-size pieces. Add 4 tablespoons orange juice. Blend, using on/off turns, until moist clumps form, adding more juice by teaspoonfuls if dough is dry. Gather dough into ball; flatten into disk. Wrap in plastic and chill at least 1 hour. DO AHEAD: Can be made 1 day ahead. Keep chilled. Roll out dough on floured surface to 14-inch round. Transfer to 10-inch-diameter glass pie dish. Cut off all but 1/2 inch of dough overhang. Fold dough edge under and crimp decoratively, forming high-standing rim. Freeze 10 minutes. DO AHEAD: Can be made 1 day ahead. Cover and refrigerate crust. Brush inside of crust with enough beaten egg white to coat.\nBlend flour, sugar, and salt in processor 5 seconds. Add butter. Using on/off turns, blend until butter is reduced to small pea-size pieces. Add 4 tablespoons orange juice. Blend, using on/off turns, until moist clumps form, adding more juice by teaspoonfuls if dough is dry. Gather dough into ball; flatten into disk. Wrap in plastic and chill at least 1 hour. DO AHEAD: Can be made 1 day ahead. Keep chilled.\nRoll out dough on floured surface to 14-inch round. Transfer to 10-inch-diameter glass pie dish. Cut off all but 1/2 inch of dough overhang. Fold dough edge under and crimp decoratively, forming high-standing rim. Freeze 10 minutes. DO AHEAD: Can be made 1 day ahead. Cover and refrigerate crust.\nBrush inside of crust with enough beaten egg white to coat.\nFor apples: Preheat oven to 350°F. Whisk brown sugar and butter in large ovenproof skillet over medium heat until butter melts, sugar dissolves, and mixture comes to boil. Boil 1 minute, whisking constantly. Remove from heat. Arrange apples, rounded side down, in syrup. Bake 15 minutes; turn over. Bake until just tender, about 20 minutes longer. Transfer apples to paper towels to cool slightly. Whisk syrup in skillet until smooth. Cool slightly and reserve. Maintain oven temperature.\nPreheat oven to 350°F. Whisk brown sugar and butter in large ovenproof skillet over medium heat until butter melts, sugar dissolves, and mixture comes to boil. Boil 1 minute, whisking constantly. Remove from heat. Arrange apples, rounded side down, in syrup. Bake 15 minutes; turn over. Bake until just tender, about 20 minutes longer. Transfer apples to paper towels to cool slightly. Whisk syrup in skillet until smooth. Cool slightly and reserve. Maintain oven temperature.\nFor filling: Mix sugar, flour, and salt in small bowl. Place eggs in medium bowl. Gradually whisk in reserved syrup from apples. Add corn syrup, vanilla, and sugar mixture; whisk until smooth. Stir in pecans. Pour filling into crust. Arrange apples, rounded side up, atop filling. Bake pie until filling is set in center, covering edges with foil if browning too quickly, about 1 hour 20 minutes. Transfer to rack and cool completely. DO AHEAD: Can be made 1 day ahead. Cover loosely with foil and let stand at room temperature.\nMix sugar, flour, and salt in small bowl. Place eggs in medium bowl. Gradually whisk in reserved syrup from apples. Add corn syrup, vanilla, and sugar mixture; whisk until smooth. Stir in pecans. Pour filling into crust. Arrange apples, rounded side up, atop filling.\nBake pie until filling is set in center, covering edges with foil if browning too quickly, about 1 hour 20 minutes. Transfer to rack and cool completely. DO AHEAD: Can be made 1 day ahead. Cover loosely with foil and let stand at room temperature.",
    "title": "Caramelized-Apple and Pecan Pie "
  },
  "AcKTUX.eKHroYkKa3qpDQKTzrTqSGdG": {
    "ingredients": [
      "1/4 teaspoon sugar",
      "1 teaspoon active dry yeast",
      "2/3 cup all-purpose flour",
      "1 teaspoon active dry yeast",
      "2 large egg yolks",
      "1 tablespoon sugar",
      "1 1/3 cups flour",
      "3 1/2 cups flour",
      "9 large egg yolks",
      "1/3 cup plus 1 tablespoon milk",
      "2 tablespoons honey",
      "3/4 cup sugar",
      "20 tablespoons (2 1/2 sticks) unsalted butter",
      "2 teaspoons salt",
      "1 teaspoon vanilla extract",
      "1 cup mixed candied fruit (such as glacéed cherries and citron, orange, or lemon peel), diced",
      "1 cup golden raisins",
      "Special equipment: 2 (8-inch) or 8 (3 1/2-inch) paper panettone molds*",
      "*Available at baking supply stores and www.sugarcraft.com."
    ],
    "picture_link": ".MAavEJR7lOzLO4jK.esjCnZKP3PyeK",
    "instructions": "Make biga: In bowl of standing mixer fitted with dough hook, combine 1/3 cup warm water (105°F to 115°F) and sugar. Stir in yeast. Let stand until yeast dissolves, about 5 minutes. Add flour and mix at low speed until smooth, about 2 minutes. Cover bowl with plastic wrap. Let rise in warm, draft-free place until tripled in volume, about 3 hours. (Can be made 5 days ahead. Stir down starter, cover and chill. Bring to room temperature before using.)\nIn bowl of standing mixer fitted with dough hook, combine 1/3 cup warm water (105°F to 115°F) and sugar. Stir in yeast. Let stand until yeast dissolves, about 5 minutes. Add flour and mix at low speed until smooth, about 2 minutes. Cover bowl with plastic wrap. Let rise in warm, draft-free place until tripled in volume, about 3 hours. (Can be made 5 days ahead. Stir down starter, cover and chill. Bring to room temperature before using.)\nStart dough: In small bowl, stir together 1/4 cup warm water (105°F to 115°F) and yeast. Let stand until yeast dissolves, about 5 minutes. Attach bowl containing biga to standing mixer fitted with dough hook, pour in yeast mixture, and mix at low speed until combined, about 2 minutes. Add egg yolks, sugar, and flour and mix at medium speed until shiny and smooth, about 5 minutes. Cover bowl with plastic wrap. Let rise in warm, draft-free place until tripled in volume, about 3 hours.\nIn small bowl, stir together 1/4 cup warm water (105°F to 115°F) and yeast. Let stand until yeast dissolves, about 5 minutes. Attach bowl containing biga to standing mixer fitted with dough hook, pour in yeast mixture, and mix at low speed until combined, about 2 minutes. Add egg yolks, sugar, and flour and mix at medium speed until shiny and smooth, about 5 minutes. Cover bowl with plastic wrap. Let rise in warm, draft-free place until tripled in volume, about 3 hours.\nFinish dough and bake bread: Attach bowl containing dough to standing mixer fitted with dough hook and add flour, egg yolks, milk, honey, 1/4 cup sugar, and 10 tablespoons butter. Mix at medium speed until blended, about 3 minutes, then add salt, vanilla, and remaining sugar. Mix at medium speed until well blended, about 5 minutes more. With mixer running, add remaining 10 tablespoons butter, 1 tablespoon at time. (Dough will become smooth and shiny and will pull away from sides of bowl.) Add candied fruit and raisins and mix until blended, about 1 minute. Form dough into ball and transfer to large bowl. Cover with clean kitchen towel and let rise in warm, draft-free place until doubled in volume, about 3 hours. Preheat oven to 350°F. Butter 2 (8-inch) or 8 (3 1/2-inch) paper panettone molds. Punch down dough, then turn out onto work surface. Divide dough into 2 pieces and form each into ball. (If using small molds, divide dough into 8 small balls.) Place 1 ball in each mold. Cover with clean kitchen towel and let rise in warm, draft-free place until dough has risen past the rim and springs back when poked, about 1 hour. Bake until golden brown, about 45 to 50 minutes. To cool, stick 2 skewers through base of each mold and suspend bread upside down by resting skewers on 2 containers taller than bread. (This helps keep bread from deflating during cooling.) When loaves are cool, wrap well in plastic wrap, then in parchment or tissue paper. Store at room temperature.\nAttach bowl containing dough to standing mixer fitted with dough hook and add flour, egg yolks, milk, honey, 1/4 cup sugar, and 10 tablespoons butter. Mix at medium speed until blended, about 3 minutes, then add salt, vanilla, and remaining sugar. Mix at medium speed until well blended, about 5 minutes more.\nWith mixer running, add remaining 10 tablespoons butter, 1 tablespoon at time. (Dough will become smooth and shiny and will pull away from sides of bowl.) Add candied fruit and raisins and mix until blended, about 1 minute. Form dough into ball and transfer to large bowl. Cover with clean kitchen towel and let rise in warm, draft-free place until doubled in volume, about 3 hours.\nPreheat oven to 350°F. Butter 2 (8-inch) or 8 (3 1/2-inch) paper panettone molds. Punch down dough, then turn out onto work surface. Divide dough into 2 pieces and form each into ball. (If using small molds, divide dough into 8 small balls.) Place 1 ball in each mold. Cover with clean kitchen towel and let rise in warm, draft-free place until dough has risen past the rim and springs back when poked, about 1 hour.\nBake until golden brown, about 45 to 50 minutes. To cool, stick 2 skewers through base of each mold and suspend bread upside down by resting skewers on 2 containers taller than bread. (This helps keep bread from deflating during cooling.)\nWhen loaves are cool, wrap well in plastic wrap, then in parchment or tissue paper. Store at room temperature.",
    "title": "Panettone with Candied Fruit "
  },
  "8GxEhUS4Eom2nDziT7bwq95jlIIKbFO": {
    "ingredients": [
      "1/2 cup chopped onion, divided",
      "1 tablespoon olive oil plus additional for brushing",
      "1/2 cup bulgur",
      "1 cup water",
      "1 cup canned pinto beans, rinsed and drained",
      "1 1/2 tablespoon soy sauce",
      "3/4 cup walnuts (2 1/2 ounces)",
      "2 garlic cloves, coarsely chopped",
      "1/2 cup packed cilantro sprigs",
      "3/4 teaspoon ground cumin",
      "1/4 teaspoon cayenne",
      "1/4 cup mayonnaise",
      "1/4 teaspoon grated lime zest",
      "1/2 teaspoon fresh lime juice",
      "4 slices multi-grain bread,toasted",
      "Equipment: a perforated grill sheet",
      "Accompaniments: lettuce; sliced tomato"
    ],
    "picture_link": "5oLug6XLs3Uzfb5gCmFw5hgbfjyn08a",
    "instructions": "Cook half of onion with 1/4 teaspoon salt in oil in a small heavy saucepan over medium heat, stirring occasionally, until golden, 5 to 7 minutes. Add bulgur and water and cook, covered, over low heat until water is absorbed, 15 to 18 minutes. Transfer to a bowl and stir in beans and soy sauce. Pulse bulgur mixture, walnuts, garlic, cilantro, cumin, cayenne, a rounded 1/4 teaspoon salt, 1/2 teaspoon pepper, and remaining onion in a food processor until finely chopped. Form rounded 1/2 cups of mixture into 4 (31/2-inch-diameter) patties. Chill at least 10 minutes. While patties chill, stir together mayonnaise, zest, and juice. Prepare grill for direct-heat cooking over medium-hot charcoal (medium heat for gas). Put perforated grill sheet on grill and preheat 10 minutes. Brush patties all over with oil. Oil grill sheet, then grill burgers on grill sheet, covered only if using a gas grill, carefully turning once, until golden brown, about 8 minutes total. Serve burgers open-faced on toast with lime mayonnaise.\nCook half of onion with 1/4 teaspoon salt in oil in a small heavy saucepan over medium heat, stirring occasionally, until golden, 5 to 7 minutes. Add bulgur and water and cook, covered, over low heat until water is absorbed, 15 to 18 minutes. Transfer to a bowl and stir in beans and soy sauce.\nPulse bulgur mixture, walnuts, garlic, cilantro, cumin, cayenne, a rounded 1/4 teaspoon salt, 1/2 teaspoon pepper, and remaining onion in a food processor until finely chopped.\nForm rounded 1/2 cups of mixture into 4 (31/2-inch-diameter) patties. Chill at least 10 minutes.\nWhile patties chill, stir together mayonnaise, zest, and juice.\nPrepare grill for direct-heat cooking over medium-hot charcoal (medium heat for gas). Put perforated grill sheet on grill and preheat 10 minutes.\nBrush patties all over with oil.\nOil grill sheet, then grill burgers on grill sheet, covered only if using a gas grill, carefully turning once, until golden brown, about 8 minutes total.\nServe burgers open-faced on toast with lime mayonnaise.",
    "title": "Bulgur Veggie Burgers with Lime Mayonnaise "
  },
  "4iFC4rMMmwoUzRcMPdWlCiHwNZjlqXu": {
    "ingredients": [
      "1 cup sifted powdered sugar",
      "3/4 cup smooth old-fashioned peanut butter",
      "2 1/2 teaspoons vanilla extract",
      "2 tablespoons Grape-Nuts cereal",
      "2 1/2 cups whole milk",
      "4 large egg yolks",
      "3/4 cup sugar",
      "1/4 cup all purpose flour",
      "1/4 cup cornstarch",
      "6 ounces good-quality white chocolate (such as Lindt or Baker's), chopped",
      "1 9-inch-diameter frozen pie shell, baked according to package directions, cooled completely",
      "2 ripe bananas, peeled, sliced",
      "1 1/2 cups chilled whipping cream, beaten to firm peaks"
    ],
    "picture_link": null,
    "instructions": "Using fork, mix powdered sugar, peanut butter and 1 teaspoon vanilla extract in medium bowl until mixture resembles coarse dry crumbs. Place cereal in small bowl. Mix 1/2 cup peanut butter mixture into cereal; set aside. Whisk 1/4 cup milk, yolks, sugar, flour and cornstarch in bowl to blend. Pour remaining 2 1/4 cups milk into heavy medium saucepan; bring to simmer. Gradually whisk hot milk into yolk mixture. Return mixture to saucepan. Whisk constantly over medium heat until custard boils and thickens, about 2 minutes. Remove from heat. Add white chocolate and remaining 1 1/2 teaspoons vanilla; whisk until chocolate melts. Cool completely. Sprinkle 1/2 cup plain (no cereal) peanut butter mixture over bottom of pie shell. Spoon half of custard filling over. Top with bananas, then remaining plain peanut butter mixture. Spoon remaining custard filling over, mounding in center. Refrigerate pie until cold, about 3 hours. (Can be made 6 hours ahead. Keep chilled.) Top with whipped cream and sprinkle with peanut butter-cereal mixture. Cut into wedges and serve.\nUsing fork, mix powdered sugar, peanut butter and 1 teaspoon vanilla extract in medium bowl until mixture resembles coarse dry crumbs. Place cereal in small bowl. Mix 1/2 cup peanut butter mixture into cereal; set aside.\nWhisk 1/4 cup milk, yolks, sugar, flour and cornstarch in bowl to blend. Pour remaining 2 1/4 cups milk into heavy medium saucepan; bring to simmer. Gradually whisk hot milk into yolk mixture. Return mixture to saucepan. Whisk constantly over medium heat until custard boils and thickens, about 2 minutes. Remove from heat. Add white chocolate and remaining 1 1/2 teaspoons vanilla; whisk until chocolate melts. Cool completely.\nSprinkle 1/2 cup plain (no cereal) peanut butter mixture over bottom of pie shell. Spoon half of custard filling over. Top with bananas, then remaining plain peanut butter mixture. Spoon remaining custard filling over, mounding in center. Refrigerate pie until cold, about 3 hours. (Can be made 6 hours ahead. Keep chilled.) Top with whipped cream and sprinkle with peanut butter-cereal mixture. Cut into wedges and serve.",
    "title": "Peanut Butter and White Chocolate Cream Pie "
  },
  "lSGw36jAaKzy0keFcuR0/VGHzLU3Bya": {
    "ingredients": [
      "2 tablespoons (1 oz) unsalted butter plus additional for greasing",
      "1 medium carrot",
      "1 celery rib",
      "4 (6- to 8-oz) trout fillets with skin",
      "1 1/2 teaspoons salt",
      "1 teaspoon black pepper",
      "4 medium shallots, cut lengthwise into 1/8-inch-thick slices (1 cup)",
      "2 fresh parsley sprigs",
      "5 black peppercorns",
      "1 1/2 cups water",
      "1 1/2 cups dry Riesling",
      "3/4 cup heavy cream",
      "2 teaspoons cornstarch",
      "2 teaspoons chopped fresh tarragon",
      "1/2 teaspoon fresh lemon juice",
      "Special equipment: an adjustable-blade slicer; tweezers or needlenose pliers"
    ],
    "picture_link": "kDgZpnpb6ENOrk92xMV3ORcmycpJ2Sq",
    "instructions": "Put oven rack in middle position and preheat oven to 375°F. Butter bottom and sides of a 13- by 9-inch glass baking dish. Cut carrot and celery lengthwise with slicer into very thin matchsticks (less than 1/8 inch wide and 2 1/2 inches long). Rinse trout and remove any pin bones with tweezers or needlenose pliers. Pat dry, then sprinkle 1/2 teaspoon each of salt and pepper on fish (flesh sides only). Arrange fillets in baking dish, skin sides down, overlapping slightly. Heat butter (2 tablespoons) in a 12-inch heavy skillet over moderate heat until foam subsides, then cook shallots, stirring, until softened, about 3 minutes (do not brown). Add carrot, celery, parsley, and peppercorns and cook, stirring, until vegetables are crisp-tender, about 5 minutes. Add water, wine, and 1/2 teaspoon salt and boil 1 minute. Remove skillet from heat and pour liquid over fish, then spread vegetables evenly in baking dish. Set skillet aside. Cover dish tightly with foil and bake until fish is just cooked through, 6 to 8 minutes. Transfer fish (topped with vegetables) to a platter and cover with foil to keep warm. Pour cooking liquid with any remaining vegetables through a sieve set over a bowl. Sprinkle vegetables from sieve over fish (discard peppercorns) and re-cover with foil. Spoon 1 cup of strained cooking liquid into cleaned skillet. Boil over high heat until reduced to about 1/2 cup, about 2 minutes. Whisk cream into cornstarch until smooth, then whisk into sauce and boil, whisking, until thickened, about 1 minute. Stir in tarragon, lemon juice, and remaining 1/2 teaspoon each of salt and pepper. Remove foil from fish and blot any liquid accumulated on platter with paper towels. Pour sauce over fish.\nPut oven rack in middle position and preheat oven to 375°F. Butter bottom and sides of a 13- by 9-inch glass baking dish.\nCut carrot and celery lengthwise with slicer into very thin matchsticks (less than 1/8 inch wide and 2 1/2 inches long).\nRinse trout and remove any pin bones with tweezers or needlenose pliers. Pat dry, then sprinkle 1/2 teaspoon each of salt and pepper on fish (flesh sides only). Arrange fillets in baking dish, skin sides down, overlapping slightly.\nHeat butter (2 tablespoons) in a 12-inch heavy skillet over moderate heat until foam subsides, then cook shallots, stirring, until softened, about 3 minutes (do not brown). Add carrot, celery, parsley, and peppercorns and cook, stirring, until vegetables are crisp-tender, about 5 minutes. Add water, wine, and 1/2 teaspoon salt and boil 1 minute. Remove skillet from heat and pour liquid over fish, then spread vegetables evenly in baking dish. Set skillet aside. Cover dish tightly with foil and bake until fish is just cooked through, 6 to 8 minutes.\nTransfer fish (topped with vegetables) to a platter and cover with foil to keep warm. Pour cooking liquid with any remaining vegetables through a sieve set over a bowl. Sprinkle vegetables from sieve over fish (discard peppercorns) and re-cover with foil.\nSpoon 1 cup of strained cooking liquid into cleaned skillet. Boil over high heat until reduced to about 1/2 cup, about 2 minutes. Whisk cream into cornstarch until smooth, then whisk into sauce and boil, whisking, until thickened, about 1 minute. Stir in tarragon, lemon juice, and remaining 1/2 teaspoon each of salt and pepper.\nRemove foil from fish and blot any liquid accumulated on platter with paper towels. Pour sauce over fish.",
    "title": "Trout in Riesling "
  },
  "AfmDjxEO2JmKPlVSxoiNnnPPnFijMGW": {
    "ingredients": [
      "3 tablespoons corn oil",
      "1 pound cleaned, uncooked lobster shells (from about three 1 3/4-pound lobsters), coarsely chopped",
      "1/4 cup brandy",
      "2 medium cloves garlic, peeled and cut across into very thin slices",
      "3 large shallots, peeled and cut across into very thin slices",
      "1/4 small fennel bulb, cut across into very thin slices",
      "2 tablespoons tomato paste",
      "4 cups water"
    ],
    "picture_link": null,
    "instructions": "1. Heat the oil in a large, wide pot over high heat until just smoking. Add the lobster shells and sear without stirring for 1 minute (the shells may stick to the pot). Stir them slightly and continue cooking, stirring from time to time until the shells are well browned but not burned, about 5 minutes. 2. Add the brandy, garlic, shallots, and fennel. Use a wooden spoon to scrape up any bits stuck to the bottom of the pot. Stir in the tomato paste. Turn the heat to medium-low and cook until the vegetables are soft, about 3 minutes. 3. Stir in the water and bring to a boil. Boil for 15 minutes. Remove from the heat and let stand for 10 minutes. Strain through a fine-mesh sieve, pressing firmly down on the solids to extract as much of the flavorful liquid as possible (see Tip, below). Store, tightly covered, in the refrigerator for up to 3 days, or in the freezer for up to 2 months.\n1. Heat the oil in a large, wide pot over high heat until just smoking. Add the lobster shells and sear without stirring for 1 minute (the shells may stick to the pot). Stir them slightly and continue cooking, stirring from time to time until the shells are well browned but not burned, about 5 minutes.\n2. Add the brandy, garlic, shallots, and fennel. Use a wooden spoon to scrape up any bits stuck to the bottom of the pot. Stir in the tomato paste. Turn the heat to medium-low and cook until the vegetables are soft, about 3 minutes.\n3. Stir in the water and bring to a boil. Boil for 15 minutes. Remove from the heat and let stand for 10 minutes. Strain through a fine-mesh sieve, pressing firmly down on the solids to extract as much of the flavorful liquid as possible (see Tip, below). Store, tightly covered, in the refrigerator for up to 3 days, or in the freezer for up to 2 months.",
    "title": "Lobster Stock "
  },
  "al7MiUkzHgNVuJ4F8KOFoFV9b7YxYIC": {
    "ingredients": [
      "2 cups fresh basil leaves, lightly packed",
      "2 pounds large Yukon Gold or white boiling potatoes",
      "1 cup half-and-half",
      "3/4 cup freshly grated Parmesan cheese, plus extra for serving",
      "2 teaspoons kosher salt",
      "1 teaspoon freshly ground black pepper"
    ],
    "picture_link": "ZPmz8AzU5QnU9IjhLiTGbWnwrg.VzPS",
    "instructions": "Bring a large pot of salted water to a rolling boil and fill a bowl with ice water. Add the basil leaves to the boiling water and cook for exactly 15 seconds. Remove the basil with a slotted spoon and immediately plunge the leaves into the ice water to set the bright green color. Drain and set aside. Peel the potatoes and cut them in quarters. Add the potatoes to the same pot of boiling water and return to a boil. Cook the potatoes for 20 to 25 minutes, until very tender. Drain well, return to the sauce- pan, and steam over low heat until any remaining water evaporates. In a small saucepan over medium heat, heat the half-and-half and Parmesan cheese until the cream simmers. Place the basil in a food processor fitted with the steel blade and purée. Add the hot cream mixture and process until smooth. With a handheld mixer with the beater attachment, beat the hot potatoes in the pot until they are broken up. Slowly add the hot basil cream, the salt, and pepper and beat until smooth. If the potatoes need to be reheated, cover and cook gently over low heat for a few minutes. Pour into a serving bowl, sprinkle with extra Parmesan cheese, season to taste, and serve hot.\nBring a large pot of salted water to a rolling boil and fill a bowl with ice water. Add the basil leaves to the boiling water and cook for exactly 15 seconds. Remove the basil with a slotted spoon and immediately plunge the leaves into the ice water to set the bright green color. Drain and set aside.\nPeel the potatoes and cut them in quarters. Add the potatoes to the same pot of boiling water and return to a boil. Cook the potatoes for 20 to 25 minutes, until very tender. Drain well, return to the sauce- pan, and steam over low heat until any remaining water evaporates.\nIn a small saucepan over medium heat, heat the half-and-half and Parmesan cheese until the cream simmers. Place the basil in a food processor fitted with the steel blade and purée. Add the hot cream mixture and process until smooth.\nWith a handheld mixer with the beater attachment, beat the hot potatoes in the pot until they are broken up. Slowly add the hot basil cream, the salt, and pepper and beat until smooth. If the potatoes need to be reheated, cover and cook gently over low heat for a few minutes. Pour into a serving bowl, sprinkle with extra Parmesan cheese, season to taste, and serve hot.",
    "title": "Potato Basil Purée "
  },
  "L9w.rdGaaZkQul8xrIceNPFy8Pa08KO": {
    "ingredients": [
      "12 butterflied fresh sardines or six 6-inch-long trout or branzino fillets with skin",
      "2 tablespoons olive oil plus additional for brushing",
      "1 tablespoon chopped fresh thyme",
      "1 tablespoon chopped fresh Italian parsley",
      "2 teaspoons grated lemon peel",
      "1 teaspoon piment d'Espelette or 1/2 teaspoon dried crushed red pepper",
      "Nonstick vegetable oil spray",
      "6 1/3-inch-thick slices sweet onion (such as Maui or Vidalia)",
      "6 6-inch-long baguette slices, cut 1/2-inch thick on sharp diagonal",
      "3 tablespoons butter, room temperature",
      "Fleur de sel*",
      "18 arugula leaves",
      "1 tablespoon extra-virgin olive oil",
      "1/2 teaspoon fresh lemon juice",
      "6 lemon wedges",
      "*A delicately flavored sea salt; available at some supermarkets and at specialty foods stores."
    ],
    "picture_link": null,
    "instructions": "Place fish, skin side down, in 13x9x2-inch glass baking dish. Whisk 2 tablespoons olive oil and next 4 ingredients in small bowl. Spread herb mixture over fish. Cover and chill at least 2 hours and up to 8 hours. Spray grill with nonstick spray. Preheat barbecue (medium heat). Brush onion slices with olive oil; sprinkle with salt and pepper. Grill onions until just tender and slightly charred, about 2 minutes per side. Grill bread slices until slightly charred, about 1 minute per side. Spread 1 side of each bread slice with butter. Sprinkle fish with fleur de sel and pepper. Grill fish until just opaque in center, about 3 minutes per side. Remove bones from fish. Place arugula in medium bowl. Drizzle with 1 tablespoon extra-virgin olive oil and lemon juice and toss; season to taste with fleur de sel and pepper. Arrange 3 arugula leaves atop each bread slice; top with grilled onions. Top onions on each bread slice with 2 sardines or 1 trout or branzino fillet, trimming fish to fit. Garnish with lemon wedges and serve.\nPlace fish, skin side down, in 13x9x2-inch glass baking dish. Whisk 2 tablespoons olive oil and next 4 ingredients in small bowl. Spread herb mixture over fish. Cover and chill at least 2 hours and up to 8 hours.\nSpray grill with nonstick spray. Preheat barbecue (medium heat). Brush onion slices with olive oil; sprinkle with salt and pepper. Grill onions until just tender and slightly charred, about 2 minutes per side. Grill bread slices until slightly charred, about 1 minute per side. Spread 1 side of each bread slice with butter. Sprinkle fish with fleur de sel and pepper. Grill fish until just opaque in center, about 3 minutes per side. Remove bones from fish.\nPlace arugula in medium bowl. Drizzle with 1 tablespoon extra-virgin olive oil and lemon juice and toss; season to taste with fleur de sel and pepper. Arrange 3 arugula leaves atop each bread slice; top with grilled onions. Top onions on each bread slice with 2 sardines or 1 trout or branzino fillet, trimming fish to fit. Garnish with lemon wedges and serve.",
    "title": "Grilled Sardine Tartines with Onion and Arugula "
  },
  "QZETPtmRHncmATglMlQWH7ah0vLvJQm": {
    "ingredients": [
      "3 plum tomatoes, diced",
      "2 scallions, trimmed, thinly sliced",
      "1 jalapeño, finely chopped",
      "1 cup fresh corn kernels (from about 2 cobs)",
      "4 tablespoons fresh lime juice (from about 2 limes)",
      "Kosher salt",
      "3 avocados, sliced",
      "6 slices crusty white bread (such as country bread), toasted"
    ],
    "picture_link": "DApwVaLfkDEUqTN9PWFXZXN8Xlp.uuy",
    "instructions": "Combine tomatoes, scallions, jalapeño, corn, and lime juice in a medium bowl. Season with salt. Using a fork, gently smash avocado slices evenly onto each toast. Top each generously with tomato-corn salsa.\nCombine tomatoes, scallions, jalapeño, corn, and lime juice in a medium bowl. Season with salt. Using a fork, gently smash avocado slices evenly onto each toast. Top each generously with tomato-corn salsa.",
    "title": "Avocado Toast with Tomato-Corn Salsa "
  },
  "0UTBFcok1o1cX9Jwq0I8V/724GOxfxO": {
    "ingredients": [
      "Olive oil",
      "Spices (we're suckers for za'atar).",
      "2 cups plain whole-milk or 2% Greek yogurt",
      "1/2 teaspoon kosher salt",
      "Cheesecloth"
    ],
    "picture_link": null,
    "instructions": "Mix 2 cups plain whole-milk or 2% Greek yogurt and 1/2 teaspoon kosher salt in a small bowl. Line a fine-mesh sieve with 2 layers of cheesecloth and set over a medium bowl. Place yogurt mixture in sieve, cover with plastic wrap, and let drain in refrigerator at least 1 day and up to 2, if you want it slightly thicker. Discard excess liquid.\nMix 2 cups plain whole-milk or 2% Greek yogurt and 1/2 teaspoon kosher salt in a small bowl. Line a fine-mesh sieve with 2 layers of cheesecloth and set over a medium bowl.\nPlace yogurt mixture in sieve, cover with plastic wrap, and let drain in refrigerator at least 1 day and up to 2, if you want it slightly thicker. Discard excess liquid.",
    "title": "Labneh "
  },
  "wVFEklKHzz1DGDbLarXJ.qKy9OXxbLu": {
    "ingredients": [
      "1/4 lb Shanghai bok choy (about 3 small heads)",
      "1 medium carrot",
      "2 1/2 tablespoons vegetable oil",
      "1 (1 1/2-inch) piece peeled fresh ginger, cut into very thin matchsticks",
      "1/4 cup medium-dry Sherry",
      "2 cups reduced-sodium chicken broth (16 fl ounces)",
      "2 teaspoons sugar",
      "3 scallions",
      "4 (4- to 5-ounce) sea bass or striped bass fillets with skin, pin bones removed",
      "1 teaspoon salt",
      "1/2 teaspoon black pepper",
      "1 teaspoon cornstarch",
      "1 teaspoon curry powder",
      "1 teaspoon Asian sesame oil",
      "Garnish: fresh cilantro leaves"
    ],
    "picture_link": null,
    "instructions": "Discard any bruised or wilted outer leaves from bok choy, then cut leaves from stalks, keeping leaves and stalks separate. Thinly slice leaves and cut stalks diagonally into 1/2-inch-wide slices. Halve carrot lengthwise and cut diagonally into 1/4-inch-thick slices. Heat 1 tablespoon vegetable oil in a 4- to 5-quart heavy pot over moderately high heat until hot but not smoking, then stir-fry bok choy stalks, carrot, and ginger 1 minute. Stir in Sherry, broth, and sugar and simmer, covered, 5 minutes. Meanwhile, cut scallions crosswise into 2-inch pieces, then halve lengthwise and cut into very thin matchsticks. Add bok choy leaves and scallions to carrot mixture and simmer, covered, until vegetables are tender, 3 to 5 minutes. While vegetables simmer, pat fish dry and sprinkle with 1/2 teaspoon salt and 1/4 teaspoon pepper. Stir together cornstarch and curry powder, then rub into skin of each fillet. Halve each fillet diagonally with a sharp knife. Stir sesame oil, remaining 1/2 teaspoon salt, and remaining 1/4 teaspoon pepper into vegetable mixture and keep warm, uncovered, on turned-off burner. Heat remaining 1 1/2 tablespoons vegetable oil in a 12-inch heavy skillet over moderately high heat until hot but not smoking, then cook fish, skin sides down, gently pressing occasionally with a metal spatula (to keep skin flat), until skin is golden, 2 to 3 minutes. Turn fish over and cook until just cooked through, about 2 minutes more. Remove from heat. Divide broth and vegetables among 4 shallow bowls and stack 2 fish halves, skin sides up, in center of each bowl.\nDiscard any bruised or wilted outer leaves from bok choy, then cut leaves from stalks, keeping leaves and stalks separate. Thinly slice leaves and cut stalks diagonally into 1/2-inch-wide slices. Halve carrot lengthwise and cut diagonally into 1/4-inch-thick slices.\nHeat 1 tablespoon vegetable oil in a 4- to 5-quart heavy pot over moderately high heat until hot but not smoking, then stir-fry bok choy stalks, carrot, and ginger 1 minute. Stir in Sherry, broth, and sugar and simmer, covered, 5 minutes.\nMeanwhile, cut scallions crosswise into 2-inch pieces, then halve lengthwise and cut into very thin matchsticks.\nAdd bok choy leaves and scallions to carrot mixture and simmer, covered, until vegetables are tender, 3 to 5 minutes.\nWhile vegetables simmer, pat fish dry and sprinkle with 1/2 teaspoon salt and 1/4 teaspoon pepper. Stir together cornstarch and curry powder, then rub into skin of each fillet. Halve each fillet diagonally with a sharp knife.\nStir sesame oil, remaining 1/2 teaspoon salt, and remaining 1/4 teaspoon pepper into vegetable mixture and keep warm, uncovered, on turned-off burner.\nHeat remaining 1 1/2 tablespoons vegetable oil in a 12-inch heavy skillet over moderately high heat until hot but not smoking, then cook fish, skin sides down, gently pressing occasionally with a metal spatula (to keep skin flat), until skin is golden, 2 to 3 minutes. Turn fish over and cook until just cooked through, about 2 minutes more. Remove from heat.\nDivide broth and vegetables among 4 shallow bowls and stack 2 fish halves, skin sides up, in center of each bowl.",
    "title": "Pan-Seared Fish Fillets in Ginger Broth "
  },
  "DfUB0AB0N/rVkM/t29Fsoq9Hhmy1NGq": {
    "ingredients": [
      "3 tablespoons extra-virgin olive oil",
      "8 ounces thinly sliced pancetta (Italian bacon), chopped",
      "2 cups thinly sliced celery hearts",
      "1 2/3 cups chopped onion",
      "1 pound Treviso radicchio or red endive (4 medium heads), quartered lengthwise, cored, then cut on diagonal into thin strips (about 6 cups), divided",
      "3 teaspoons chopped fresh thyme, divided",
      "1 garlic clove, finely chopped",
      "9 lasagna noodles (each 7 x 3 inches)",
      "1/4 cup (1/2 stick) unsalted butter",
      "2 1/2 tablespoons all purpose flour",
      "2 cups whole milk",
      "Pinch of ground nutmeg",
      "Pinch of ground white pepper",
      "12 ounces Taleggio cheese,* rind removed, cheese cut into 1/2-inch cubes",
      "1/2 cup finely grated Parmesan cheese, divided",
      "2 tablespoons coarse dry breadcrumbs (preferably from crustless Italian bread)",
      "Olive oil"
    ],
    "picture_link": "q0tk2NaME3PBCTHJBpWiEM/R5iMjK6a",
    "instructions": "For filling and pasta: Heat oil in heavy large skillet over medium heat. Add pancetta, celery, and onion. Sauté until vegetables are soft but not brown, about 12 minutes. Transfer 1/2 cup sliced Treviso to small bowl and reserve for topping. Add remaining Treviso, 2 teaspoons thyme, and garlic to skillet. Toss until Treviso wilts, about 3 minutes. Season filling with salt and pepper. Cook lasagna noodles in large pot of boiling salted water until just tender but still firm to bite, stirring occasionally. Drain noodles. Arrange noodles in single layer on large sheet of plastic wrap; cover with second sheet to avoid drying. DO AHEAD: Filling and pasta can be made 2 hours ahead. Let stand at room temperature.\nHeat oil in heavy large skillet over medium heat. Add pancetta, celery, and onion. Sauté until vegetables are soft but not brown, about 12 minutes. Transfer 1/2 cup sliced Treviso to small bowl and reserve for topping. Add remaining Treviso, 2 teaspoons thyme, and garlic to skillet. Toss until Treviso wilts, about 3 minutes. Season filling with salt and pepper.\nCook lasagna noodles in large pot of boiling salted water until just tender but still firm to bite, stirring occasionally. Drain noodles. Arrange noodles in single layer on large sheet of plastic wrap; cover with second sheet to avoid drying. DO AHEAD: Filling and pasta can be made 2 hours ahead. Let stand at room temperature.\nFor sauce: Melt butter in heavy medium saucepan over medium-low heat. Add flour and whisk until roux is pale gold color, about 2 minutes. Gradually whisk in milk; add nutmeg and white pepper. Increase heat to medium and cook until sauce thickens and boils, whisking often, 2 to 3 minutes. Reduce heat to low. Add Taleggio cheese in 4 batches, whisking to melt before adding more, about 4 minutes. Season sauce to taste with salt and pepper. Spoon 1/2 cup sauce into 13 x 9 x 2-inch glass baking dish; spread to cover bottom thinly. Arrange 3 noodles, crosswise and side by side, in dish; trim ends if necessary to fit. Transfer 3/4 cup filling to another small bowl and reserve for topping. Spoon half of remaining filling over noodles. Drizzle with 2/3 cup sauce; sprinkle with 1/4 cup Parmesan cheese. Repeat with noodles, filling, sauce, and Parmesan. Top with third layer of noodles; drizzle with 2/3 cup sauce. Spoon reserved 3/4 cup filling down center of lasagna lengthwise in 2-inch-wide strip. Drizzle strip with remaining sauce, then top with breadcrumbs. DO AHEAD: Can be made 1 day ahead. Cover and chill. Let stand at room temperature 1 hour before continuing. Preheat oven to 375°F. Bake lasagna uncovered until heated through and sauce is bubbling, about 35 minutes. Remove from oven; let cool 15 minutes. Toss reserved Treviso in small bowl with splash of olive oil and sprinkle of salt and pepper. Sprinkle over strip of filling. Sprinkle with remaining 1 teaspoon thyme.\nMelt butter in heavy medium saucepan over medium-low heat. Add flour and whisk until roux is pale gold color, about 2 minutes. Gradually whisk in milk; add nutmeg and white pepper. Increase heat to medium and cook until sauce thickens and boils, whisking often, 2 to 3 minutes. Reduce heat to low. Add Taleggio cheese in 4 batches, whisking to melt before adding more, about 4 minutes. Season sauce to taste with salt and pepper.\nSpoon 1/2 cup sauce into 13 x 9 x 2-inch glass baking dish; spread to cover bottom thinly. Arrange 3 noodles, crosswise and side by side, in dish; trim ends if necessary to fit. Transfer 3/4 cup filling to another small bowl and reserve for topping. Spoon half of remaining filling over noodles. Drizzle with 2/3 cup sauce; sprinkle with 1/4 cup Parmesan cheese. Repeat with noodles, filling, sauce, and Parmesan. Top with third layer of noodles; drizzle with 2/3 cup sauce. Spoon reserved 3/4 cup filling down center of lasagna lengthwise in 2-inch-wide strip. Drizzle strip with remaining sauce, then top with breadcrumbs. DO AHEAD: Can be made 1 day ahead. Cover and chill. Let stand at room temperature 1 hour before continuing.\nPreheat oven to 375°F. Bake lasagna uncovered until heated through and sauce is bubbling, about 35 minutes. Remove from oven; let cool 15 minutes.\nToss reserved Treviso in small bowl with splash of olive oil and sprinkle of salt and pepper. Sprinkle over strip of filling. Sprinkle with remaining 1 teaspoon thyme.",
    "title": "Pancetta and Taleggio Lasagna with Treviso "
  },
  "zwTm5Cma5WEL.ZTFDYsp2gVlk1oyKHO": {
    "ingredients": [
      "1/2 cup chopped mango",
      "1/2 cup chopped pineapple",
      "1/2 cup nonfat high-protein plain Greek yogurt or kefir",
      "4 mint leaves, torn into pieces"
    ],
    "picture_link": "N/aUghtXih1Aznbl45tyNt9nzf.QldC",
    "instructions": "Place all the ingredients and 3 ice cubes in a blender and blend on high speed for about 60 seconds or until smooth.\nPlace all the ingredients and 3 ice cubes in a blender and blend on high speed for about 60 seconds or until smooth.\nPour into a chilled glass and enjoy.\nPour into a chilled glass and enjoy.",
    "title": "Mango, Mint, and Pineapple Smoothie "
  },
  "1GW9hHi9W3xTy0w825dfvfWxpyOZYVG": {
    "ingredients": [
      "6 tablespoons kosher salt",
      "4 tablespoons black peppercorns, medium ground",
      "1 tablespoon granulated sugar",
      "1 tablespoon paprika",
      "1 (12–14-pound) turkey",
      "1 head of garlic, cut in half crosswise",
      "2 sprigs rosemary",
      "Olive oil (for cooking; 5–7 cups)",
      "1/2 cup (packed) light brown sugar",
      "1/2 cup bourbon",
      "2 tablespoons soy sauce",
      "2 tablespoons unsalted butter",
      "1 teaspoon paprika"
    ],
    "picture_link": "kTIHlcL8/zE0NoAEeDaV7i1LUSWmoXe",
    "instructions": "Dry brine: Mix salt, pepper, granulated sugar, and paprika in a small bowl. Arrange turkey on a cutting board breast side up. Remove legs (keeping thigh and drumstick intact) by slicing through the skin that joins breast and leg, then bend leg down to expose joint and cut completely through the joint. Try to leave as much skin on breast as possible. Place legs on a large rimmed baking sheet. Set aside neck and giblets in cavity for making gravy. Arrange turkey on baking sheet with legs and generously sprinkle legs and turkey all over with dry brine, patting to adhere. Chill, uncovered, at least 12 hours and up to 2 days.\nMix salt, pepper, granulated sugar, and paprika in a small bowl. Arrange turkey on a cutting board breast side up. Remove legs (keeping thigh and drumstick intact) by slicing through the skin that joins breast and leg, then bend leg down to expose joint and cut completely through the joint. Try to leave as much skin on breast as possible. Place legs on a large rimmed baking sheet. Set aside neck and giblets in cavity for making gravy. Arrange turkey on baking sheet with legs and generously sprinkle legs and turkey all over with dry brine, patting to adhere. Chill, uncovered, at least 12 hours and up to 2 days.\nConfit legs: Wipe off turkey legs (do not rinse) and place in the smallest heavy pot that will accommodate legs in a single layer (it’s okay if they overlap slightly). Add garlic and rosemary. Pour in oil just to barely cover legs. Heat over medium until a few bubbles begin to appear. Cover, reduce heat, and very gently simmer until meat is tender (the meat on the drumstick will have pulled away from the bone), 3–3 1/2 hours. Let turkey thighs cool in oil until just warm, about 2 hours. Chill at least 2 hours but preferably longer. Meat will firm up the colder it gets, making it less likely to fall apart when glazing.\nWipe off turkey legs (do not rinse) and place in the smallest heavy pot that will accommodate legs in a single layer (it’s okay if they overlap slightly). Add garlic and rosemary. Pour in oil just to barely cover legs. Heat over medium until a few bubbles begin to appear. Cover, reduce heat, and very gently simmer until meat is tender (the meat on the drumstick will have pulled away from the bone), 3–3 1/2 hours. Let turkey thighs cool in oil until just warm, about 2 hours. Chill at least 2 hours but preferably longer. Meat will firm up the colder it gets, making it less likely to fall apart when glazing.\nBreast and assembly: Preheat oven to 425°F. Place turkey on a wire rack set inside a large rimmed baking sheet. Roast, rotating baking sheet once, until golden brown all over, 35–40 minutes. Meanwhile, bring brown sugar, bourbon, soy sauce, butter, and paprika to a simmer in a small saucepan over medium heat, stirring occasionally, until reduced by about half and thick enough to coat a spoon but not syrupy, 6–8 minutes. Reduce heat to very low and keep glaze warm until ready to use. Reduce oven temperature to 325°F and roast turkey until an instant-read thermometer inserted into the thickest part of breast registers 100°F–110°F. Then roast, basting every 10 minutes or so, making sure to lightly coat the entire breast each time (but save some glaze for the legs) and rotating baking sheet occasionally, until thermometer registers 150°F, 60–75 minutes total after reducing oven temperature to 325°F. Transfer breast to a cutting board and let rest at least 30 minutes before carving. Increase oven temperature back to 425°F. Remove turkey legs from oil, wiping off excess, and place on a clean rimmed baking sheet; discard or chill cooking oil (skim off juices and use them in gravy; use oil for cassoulet or another confit). Carefully move a rack to upper third of oven and roast legs until skin is golden brown and fat is rendered, 15–20 minutes. Then roast, basting every 3 minutes or so with remaining glaze, until legs are well coated, 10–12 minutes. Arrange on a platter with sliced breast for serving.\nPreheat oven to 425°F. Place turkey on a wire rack set inside a large rimmed baking sheet. Roast, rotating baking sheet once, until golden brown all over, 35–40 minutes.\nMeanwhile, bring brown sugar, bourbon, soy sauce, butter, and paprika to a simmer in a small saucepan over medium heat, stirring occasionally, until reduced by about half and thick enough to coat a spoon but not syrupy, 6–8 minutes. Reduce heat to very low and keep glaze warm until ready to use.\nReduce oven temperature to 325°F and roast turkey until an instant-read thermometer inserted into the thickest part of breast registers 100°F–110°F. Then roast, basting every 10 minutes or so, making sure to lightly coat the entire breast each time (but save some glaze for the legs) and rotating baking sheet occasionally, until thermometer registers 150°F, 60–75 minutes total after reducing oven temperature to 325°F. Transfer breast to a cutting board and let rest at least 30 minutes before carving.\nIncrease oven temperature back to 425°F. Remove turkey legs from oil, wiping off excess, and place on a clean rimmed baking sheet; discard or chill cooking oil (skim off juices and use them in gravy; use oil for cassoulet or another confit).\nCarefully move a rack to upper third of oven and roast legs until skin is golden brown and fat is rendered, 15–20 minutes. Then roast, basting every 3 minutes or so with remaining glaze, until legs are well coated, 10–12 minutes. Arrange on a platter with sliced breast for serving.\nDo Ahead Legs can be cooked 1 day ahead. Keep chilled in oil.\nLegs can be cooked 1 day ahead. Keep chilled in oil.",
    "title": "Bourbon and Brown Sugar Glazed Turkey "
  },
  "sl5OwEu93D0AFIYab6WE4acg/Q./Wea": {
    "ingredients": [
      "2 3/4 cups sprouted spelt flour or whole wheat pastry flour",
      "1 teaspoon baking powder",
      "2 teaspoons baking soda",
      "3/4 teaspoon sea salt",
      "2/3 cup unsweetened cocoa powder, sifted",
      "1/2 cup canola oil",
      "1 1/4 cups light agave nectar",
      "1 cup soy milk",
      "1/2 cup firm silken tofu",
      "1 tablespoon vanilla extract",
      "2 tablespoons raw apple cider vinegar",
      "12 ounces light firm silken tofu",
      "1/2 cup light agave nectar",
      "1 cup smooth peanut butter",
      "1 tablespoon vanilla extract",
      "1/2 teaspoon sea salt",
      "Vegan Chocolate Ganache Frosting",
      "Chopped toasted peanuts, for garnish (optional)"
    ],
    "picture_link": "YDv3GJpUidcpzd5nNfMP5kdLBisZAZK",
    "instructions": "Preheat the oven to 325°F. Line 2 cupcake pans with 18 paper liners and fill the empty cups half full of water to prevent scorching. To make the cupcakes, mix the flour, baking powder, baking soda, salt, and cocoa powder together in a large bowl. In a food processor, blend the canola oil, agave nectar, soy milk, tofu, vanilla extract, and vinegar, scraping down the bowl often. Blend until very smooth, with no chunks of tofu visible, about 2 to 3 minutes. Combine the wet ingredients with the dry ingredients. Stir well and spoon into the prepared cupcake pan, leaving some room at the top of each cup. Bake for 20 minutes, or until a toothpick inserted into the center of a cupcake comes out clean. Remove the cupcakes from the pan and place on a cooling rack. Cool completely before filling and frosting. To prepare the filling, blend the tofu in a food processor until very smooth and creamy, approximately 1 to 2 minutes. Add the agave nectar and blend again. Add the peanut butter, vanilla extract, and salt and blend thoroughly until very light and smooth. Refrigerate for 1 to 2 hours to firm before filling the cupcakes. To assemble the cupcakes, you will need a pastry bag fitted with a large, plain smooth tip. Fill the pastry bag with peanut butter mousse and insert the tip halfway into the top of a cupcake. Squeeze filling inside each cupcake just until it starts to expand. Next frost the tops. If the frosting is too firm, heat in the microwave for a few seconds to soften it up. Spread the ganache evenly over the tops of the cupcakes. Let the cupcakes sit in the refrigerator until ready to serve. Garnish with peanuts if desired.\nPreheat the oven to 325°F. Line 2 cupcake pans with 18 paper liners and fill the empty cups half full of water to prevent scorching.\nTo make the cupcakes, mix the flour, baking powder, baking soda, salt, and cocoa powder together in a large bowl. In a food processor, blend the canola oil, agave nectar, soy milk, tofu, vanilla extract, and vinegar, scraping down the bowl often. Blend until very smooth, with no chunks of tofu visible, about 2 to 3 minutes. Combine the wet ingredients with the dry ingredients. Stir well and spoon into the prepared cupcake pan, leaving some room at the top of each cup. Bake for 20 minutes, or until a toothpick inserted into the center of a cupcake comes out clean. Remove the cupcakes from the pan and place on a cooling rack. Cool completely before filling and frosting.\nTo prepare the filling, blend the tofu in a food processor until very smooth and creamy, approximately 1 to 2 minutes. Add the agave nectar and blend again. Add the peanut butter, vanilla extract, and salt and blend thoroughly until very light and smooth. Refrigerate for 1 to 2 hours to firm before filling the cupcakes.\nTo assemble the cupcakes, you will need a pastry bag fitted with a large, plain smooth tip. Fill the pastry bag with peanut butter mousse and insert the tip halfway into the top of a cupcake. Squeeze filling inside each cupcake just until it starts to expand.\nNext frost the tops. If the frosting is too firm, heat in the microwave for a few seconds to soften it up. Spread the ganache evenly over the tops of the cupcakes. Let the cupcakes sit in the refrigerator until ready to serve.\nGarnish with peanuts if desired.",
    "title": "Chocolate Peanut Butter Mousse\u0096Filled Cupcakes "
  },
  "FlJde6SONl9KSRvqEv6cqYbcAUp4Ke2": {
    "ingredients": [
      "3 cups (about 3/4 pound) diced, cooked smoked turkey breast",
      "1 can (15.5 ounces) black beans, rinsed and drained",
      "1 1/2 cups fresh corn kernels",
      "1 cup cherry tomatoes, halved",
      "1 cup diced bell peppers (any colors)",
      "1/2 cup finely chopped red onion",
      "3 cups arugula",
      "1/2 cup chopped fresh mint (plus leaves for garnish)",
      "1 tablespoon finely chopped garlic",
      "1/2 cup tomato juice",
      "2 tablespoon fresh lemon juice",
      "1 tablespoon sherry (or balsamic) vinegar",
      "1 tablespoon olive oil"
    ],
    "picture_link": "6qod3Cd9TdH2DBZsV1a6XDvoacyZmd2",
    "instructions": "Combine turkey, beans, corn, tomatoes, bell peppers and onion in a bowl. Whisk all dressing ingredients in another bowl. Season with salt and pepper. Add dressing to turkey mixture and toss to combine. Divide arugula among 4 plates and top with turkey salad.\nCombine turkey, beans, corn, tomatoes, bell peppers and onion in a bowl. Whisk all dressing ingredients in another bowl. Season with salt and pepper. Add dressing to turkey mixture and toss to combine. Divide arugula among 4 plates and top with turkey salad.",
    "title": "Smoked Turkey, Black Bean, Bell Pepper and Corn Salad "
  },
  "2rbnaWpaHTlHRAE0fj.WvWElST8d6wS": {
    "ingredients": [
      "1 1/2 cups all purpose flour",
      "1 tablespoon sugar",
      "1/2 teaspoon salt",
      "1/8 teaspoon baking powder",
      "1/2 cup (1 stick) chilled unsalted butter, cut into 1/2-inch cubes",
      "1/4 cup (or more) ice water",
      "1 teaspoon apple cider vinegar",
      "1 cup (packed) golden brown sugar",
      "3 tablespoons all purpose flour",
      "2 teaspoons finely grated lemon peel",
      "1 1/4 teaspoons ground cinnamon",
      "2 3/4 pounds Granny Smith apples (about 6 medium), peeled, halved, cored, cut into 1/8-inch-thick slices (about 8 cups)",
      "1 cup raisins",
      "2 teaspoons vanilla extract",
      "1 cup all purpose flour",
      "1/2 cup (packed) golden brown sugar",
      "1 teaspoon ground cinnamon",
      "1/8 teaspoon salt",
      "1/2 cup (1 stick) chilled unsalted butter, cut into 1/2-inch cubes",
      "Lightly sweetened whipped cream or vanilla ice cream"
    ],
    "picture_link": "YkdWNR7iezFmwFY3BmDSirnIu0f4AS2",
    "instructions": "For crust: Blend flour, sugar, salt, and baking powder in processor. Add butter; pulse until mixture resembles coarse meal. Mix 1/4 cup ice water and vinegar in small bowl; add to processor and pulse until moist clumps form, adding more ice water by teaspoonfuls if mixture is dry. Gather dough into ball; flatten into disk. Wrap in plastic and chill at least 1 hour. DO AHEAD: Can be made 1 day ahead. Keep chilled. Soften slightly at room temperature before rolling out. Roll out dough on floured work surface to 13-inch round. Transfer to 9-inch-diameter deep-dish glass pie dish. Fold edges under and crimp, forming crust sides 1/4 inch above rim of pie dish. Freeze crust 20 minutes.\nBlend flour, sugar, salt, and baking powder in processor. Add butter; pulse until mixture resembles coarse meal. Mix 1/4 cup ice water and vinegar in small bowl; add to processor and pulse until moist clumps form, adding more ice water by teaspoonfuls if mixture is dry. Gather dough into ball; flatten into disk. Wrap in plastic and chill at least 1 hour. DO AHEAD: Can be made 1 day ahead. Keep chilled. Soften slightly at room temperature before rolling out.\nRoll out dough on floured work surface to 13-inch round. Transfer to 9-inch-diameter deep-dish glass pie dish. Fold edges under and crimp, forming crust sides 1/4 inch above rim of pie dish. Freeze crust 20 minutes.\nFor filling: Position rack in center of oven and preheat to 375°F. Mix brown sugar, flour, lemon peel, and cinnamon in large bowl. Add apple slices, raisins, and vanilla; toss until well coated. Transfer filling to unbaked crust, mounding filling slightly in center. Bake pie until apples begin to soften, about 40 minutes.\nPosition rack in center of oven and preheat to 375°F. Mix brown sugar, flour, lemon peel, and cinnamon in large bowl. Add apple slices, raisins, and vanilla; toss until well coated. Transfer filling to unbaked crust, mounding filling slightly in center. Bake pie until apples begin to soften, about 40 minutes.\nMeanwhile, prepare crumb topping: Whisk flour, sugar, cinnamon, and salt in small bowl. Add butter and rub in with fingertips until mixture begins to clump together.\nWhisk flour, sugar, cinnamon, and salt in small bowl. Add butter and rub in with fingertips until mixture begins to clump together.\nSprinkle topping evenly over hot pie. Continue to bake pie until apples are tender and topping is browned and crisp, tenting pie with sheet of foil if browning too quickly, about 50 minutes. Cool pie on rack at least 2 hours. DO AHEAD: Can be made 8 hours ahead. Let stand at room temperature. Cut pie into wedges and serve warm or at room temperature with whipped cream or vanilla ice cream.\nSprinkle topping evenly over hot pie. Continue to bake pie until apples are tender and topping is browned and crisp, tenting pie with sheet of foil if browning too quickly, about 50 minutes. Cool pie on rack at least 2 hours. DO AHEAD: Can be made 8 hours ahead. Let stand at room temperature.\nCut pie into wedges and serve warm or at room temperature with whipped cream or vanilla ice cream.\nGOOD TO KNOW: Don't skip that teaspoon of vinegar in the pie dough—it helps make the finished crust tender.\nDon't skip that teaspoon of vinegar in the pie dough—it helps make the finished crust tender.",
    "title": "Cinnamon Apple Pie with Raisins and Crumb Topping "
  },
  "L9MMXOAFF5BGz6jUxlIYsJyD1cwXTQO": {
    "ingredients": [
      "1/2 cup masa harina (tortilla flour)",
      "5 cups water",
      "1 1/2 cups chopped fresh pineapple",
      "2/3 cup sugar"
    ],
    "picture_link": null,
    "instructions": "Whisk together flour and 2 cups water in a 3-quart heavy saucepan. Purée pineapple with sugar and remaining 3 cups water in a blender until smooth and pour through a sieve into flour mixture. Stir mixtures together with a wooden spoon and simmer, stirring constantly, 15 minutes. Atole keeps 1 day, cooled completely before being covered and chilled. Reheat before serving.\nWhisk together flour and 2 cups water in a 3-quart heavy saucepan.\nPurée pineapple with sugar and remaining 3 cups water in a blender until smooth and pour through a sieve into flour mixture. Stir mixtures together with a wooden spoon and simmer, stirring constantly, 15 minutes.\nAtole keeps 1 day, cooled completely before being covered and chilled. Reheat before serving.",
    "title": "Atole de Piña "
  },
  "t3AWAsosWT/cHeGx24daHM/.Px9Ooqm": {
    "ingredients": [
      "4 ears corn, shucked, discarding husks but reserving silk",
      "1 pound smoked turkey leg",
      "5 cups water",
      "1 large onion, quartered, divided",
      "1/2 stick unsalted butter",
      "1 pound small okra",
      "3 1/2 tablespoons all-purpose flour",
      "1 cup whole milk",
      "3 cups all-purpose flour",
      "1 tablespoon baking powder",
      "1 1/4 teaspoons baking soda",
      "1/4 cup finely chopped chives",
      "1 1/4 sticks cold unsalted butter, cut into bits",
      "1 1/2 cups well-shaken buttermilk",
      "Garnish: finely chopped chives"
    ],
    "picture_link": "mDf0/zW4ZbbgF9a3I0262E4/AWehVDC",
    "instructions": "Make Stew: Heat a 12-inch heavy skillet (not nonstick; preferably cast-iron) over medium heat until hot, then brown ears of corn, in batches if necessary. Cut kernels from cobs and set aside. Put cobs and silk into a medium pot. Remove skin, bone, and tendons from turkey (reserve meat) and add to cobs along with water, 1 onion quarter, and 1 teaspoon salt, then simmer briskly until liquid is reduced to about 3 cups, 30 to 40 minutes. Strain broth through a sieve into a bowl, discarding solids. Cut turkey meat into 1/2-inch pieces. Coarsely chop remaining onion, then cook in butter with 1/4 teaspoon each of salt and pepper in skillet over medium heat, stirring occasionally, until softened, 4 to 5 minutes. Stir in okra and cook, stirring occasionally, until tender, 5 to 10 minutes. Sprinkle flour over vegetables and cook, stirring, 1 minute. Stir in corn broth and milk. Bring to a boil, stirring, then boil over medium heat, stirring occasionally, until slightly thickened, about 2 minutes. Stir in corn kernels and turkey, then gently simmer until heated through, 1 to 2 minutes.\nHeat a 12-inch heavy skillet (not nonstick; preferably cast-iron) over medium heat until hot, then brown ears of corn, in batches if necessary. Cut kernels from cobs and set aside. Put cobs and silk into a medium pot. Remove skin, bone, and tendons from turkey (reserve meat) and add to cobs along with water, 1 onion quarter, and 1 teaspoon salt, then simmer briskly until liquid is reduced to about 3 cups, 30 to 40 minutes. Strain broth through a sieve into a bowl, discarding solids.\nCut turkey meat into 1/2-inch pieces.\nCoarsely chop remaining onion, then cook in butter with 1/4 teaspoon each of salt and pepper in skillet over medium heat, stirring occasionally, until softened, 4 to 5 minutes. Stir in okra and cook, stirring occasionally, until tender, 5 to 10 minutes. Sprinkle flour over vegetables and cook, stirring, 1 minute. Stir in corn broth and milk. Bring to a boil, stirring, then boil over medium heat, stirring occasionally, until slightly thickened, about 2 minutes.\nStir in corn kernels and turkey, then gently simmer until heated through, 1 to 2 minutes.\nMake shortcakes while broth simmers: Preheat oven to 450°F with rack in middle. Sift together flour, baking powder, baking soda, and 1 teaspoon each of salt and pepper into a bowl. Stir in chives. Blend in butter with a pastry blender or your fingertips until mixture resembles coarse meal. Add buttermilk and stir with a fork until a dough just forms (dough will be moist). Turn out dough onto a well-floured surface, lightly dust dough with flour, and knead gently 6 to 8 times. Roll out dough on a floured surface with a floured rolling pin into a 12- by 6-inch rectangle (1 inch thick), reflouring surface if necessary. Cut into 8 (3-inch) squares with a floured knife. Transfer biscuits with a metal spatula to an ungreased baking sheet, arranging 2 inches apart. Bake until golden, 12 to 15 minutes, then transfer to a rack to cool to warm. Halve biscuits horizontally and put each bottom half in a shallow bowl. Spoon stew over biscuit bottoms and cover with tops.\nPreheat oven to 450°F with rack in middle.\nSift together flour, baking powder, baking soda, and 1 teaspoon each of salt and pepper into a bowl. Stir in chives. Blend in butter with a pastry blender or your fingertips until mixture resembles coarse meal. Add buttermilk and stir with a fork until a dough just forms (dough will be moist).\nTurn out dough onto a well-floured surface, lightly dust dough with flour, and knead gently 6 to 8 times. Roll out dough on a floured surface with a floured rolling pin into a 12- by 6-inch rectangle (1 inch thick), reflouring surface if necessary. Cut into 8 (3-inch) squares with a floured knife. Transfer biscuits with a metal spatula to an ungreased baking sheet, arranging 2 inches apart.\nBake until golden, 12 to 15 minutes, then transfer to a rack to cool to warm. Halve biscuits horizontally and put each bottom half in a shallow bowl. Spoon stew over biscuit bottoms and cover with tops.",
    "title": "Chive Shortcakes with Smoky Corn and Okra Stew "
  },
  "9NmjGfDKbROQZnGqW19JOL4vdP2Q.M.": {
    "ingredients": [
      "Nonstick vegetable oil spray",
      "1 cup sugar",
      "1/4 cup water",
      "2 tablespoons pine nuts"
    ],
    "picture_link": null,
    "instructions": "Spray heavy large baking sheet with vegetable oil spray. Stir sugar and water in heavy small saucepan over medium-low heat until sugar dissolves. Increase heat and boil without stirring until syrup turns deep golden, occasionally brushing down sides of pan with pastry brush dipped into water and swirling pan, about 7 minutes. Immediately pour out mixture onto prepared baking sheet, sprinkle with pine nuts. Working quickly and carefully (mixture is very hot and hardens fast), press tip of knife into edges of caramel sheet and gently stretch in all directions until caramel becomes thin and transparent. Cool completely. Break brittle into irregular large pieces. (Brittle can be prepared 3 days ahead. Store in airtight container at room temperature.)\nSpray heavy large baking sheet with vegetable oil spray. Stir sugar and water in heavy small saucepan over medium-low heat until sugar dissolves. Increase heat and boil without stirring until syrup turns deep golden, occasionally brushing down sides of pan with pastry brush dipped into water and swirling pan, about 7 minutes. Immediately pour out mixture onto prepared baking sheet, sprinkle with pine nuts.\nWorking quickly and carefully (mixture is very hot and hardens fast), press tip of knife into edges of caramel sheet and gently stretch in all directions until caramel becomes thin and transparent. Cool completely. Break brittle into irregular large pieces. (Brittle can be prepared 3 days ahead. Store in airtight container at room temperature.)",
    "title": "Pine Nut Brittle "
  },
  "W274jkaAmPmIlBQfKRvObkeSs4iMJiu": {
    "ingredients": [
      "1 small garlic clove",
      "1/4 cup fresh coriander",
      "3 tablespoons fresh lemon juice",
      "1/2 teaspoon sugar",
      "1/4 teaspoon salt",
      "1/2 cup olive oil",
      "a 14-ounce can hearts of palm, drained",
      "4 California firm-ripe avocados",
      "1 small red onion, sliced thin",
      "Boston lettuce leaves (from about 2 heads)"
    ],
    "picture_link": null,
    "instructions": "Make vinaigrette: In a blender purée garlic and coriander with lemon juice, sugar, and salt. With motor running add oil in a stream, blending until dressing is emulsified.\nIn a blender purée garlic and coriander with lemon juice, sugar, and salt. With motor running add oil in a stream, blending until dressing is emulsified.\nMake salad: Cut hearts of palm and avocado into 3/4-inch cubes and in a large bowl with a rubber spatula gently toss with onion and vinaigrette until combined well.\nCut hearts of palm and avocado into 3/4-inch cubes and in a large bowl with a rubber spatula gently toss with onion and vinaigrette until combined well.\nLine 8 salad plates with lettuce leaves and mound avocado mixture on top.\nLine 8 salad plates with lettuce leaves and mound avocado mixture on top.",
    "title": "Avocado, Hearts of Palm, and Red Onion Salad with Coriander Vinaigrette "
  },
  "T1Hz082zmL14UqzcJQnAxWXG3YHf5BC": {
    "ingredients": [
      "2 1/4 sticks unsalted butter",
      "2 cups sifted cake flour (not self-rising; sift before measuring)",
      "1 teaspoon baking powder",
      "1/2 teaspoon salt",
      "1/2 cup packed light brown sugar",
      "1/2 cup granulated sugar",
      "4 large eggs",
      "1/2 teaspoon pure vanilla extract"
    ],
    "picture_link": "UQA.t1GhRHhk/ToiU16zEXmm7.s6rHu",
    "instructions": "Preheat oven to 325°F with rack in middle. Butter and lightly flour an 8 1/2-by 4 1/2-inch loaf pan. Heat butter in a 10-inch heavy skillet over medium heat until milk solids on bottom are a dark chocolate brown. Transfer to a shallow bowl and chill in freezer until just congealed, about 15 minutes. Whisk together flour, baking powder, and salt. Beat together brown butter and sugars with an electric mixer until fluffy, about 2 minutes. Add eggs 1 at a time, beating well after each addition. Beat in vanilla. At low speed, mix in flour mixture until just incorporated. Transfer batter to pan, smoothing top, then rap pan on counter to settle batter. Bake until golden-brown and a wooden pick inserted into center comes out clean, 1 to 1 1/4 hours. Cool in pan 30 minutes, then invert cake onto a rack and cool completely, right side up, 1 hour.\nPreheat oven to 325°F with rack in middle. Butter and lightly flour an 8 1/2-by 4 1/2-inch loaf pan.\nHeat butter in a 10-inch heavy skillet over medium heat until milk solids on bottom are a dark chocolate brown. Transfer to a shallow bowl and chill in freezer until just congealed, about 15 minutes.\nWhisk together flour, baking powder, and salt.\nBeat together brown butter and sugars with an electric mixer until fluffy, about 2 minutes. Add eggs 1 at a time, beating well after each addition. Beat in vanilla.\nAt low speed, mix in flour mixture until just incorporated.\nTransfer batter to pan, smoothing top, then rap pan on counter to settle batter. Bake until golden-brown and a wooden pick inserted into center comes out clean, 1 to 1 1/4 hours. Cool in pan 30 minutes, then invert cake onto a rack and cool completely, right side up, 1 hour.",
    "title": "Brown Butter Pound Cake "
  },
  "ocE02vtEZnh2eTegpRZIiq3tlT5GImu": {
    "ingredients": [
      "1 750-ml bottle of chilled brut Champagne",
      "2 1/2 cups chilled apricot nectar",
      "3 tablespoons Grand Marnier or other orange liqueur"
    ],
    "picture_link": null,
    "instructions": "Mix chilled Champagne, chilled apricot nectar, and Grand Marnier in tall pitcher. Pour into Champagne flutes and serve.\nMix chilled Champagne, chilled apricot nectar, and Grand Marnier in tall pitcher. Pour into Champagne flutes and serve.",
    "title": "Apricot Bellini "
  },
  "YiFh/nPFhxqZKv42OsIjqricwz/ikM.": {
    "ingredients": [
      "3 tablespoons extra-virgin olive oil, divided",
      "4 large chicken thighs with skin and bones (about 1 1/3 pounds)",
      "3/4 pound fresh mild or hot Italian sausages",
      "3/4 pound large mushrooms, quartered",
      "2 12-ounce containers grape tomatoes",
      "1/2 cup dry red wine",
      "3 large garlic cloves, pressed",
      "1 1/2 teaspoons chopped fresh rosemary",
      "1/2 cup coarsely chopped fresh basil"
    ],
    "picture_link": null,
    "instructions": "Heat 2 tablespoons oil in large nonstick skillet over medium-high heat. Sprinkle chicken with salt and pepper. Add chicken and sausages to skillet. Sauté until brown, 4 to 5 minutes per side. Transfer chicken and sausages to bowl. Add mushrooms to skillet. Sauté until brown, about 4 minutes; add to same bowl. Add remaining 1 tablespoon oil to skillet; add tomatoes, red wine, garlic, and rosemary. Cover, reduce heat to medium, and cook until tomatoes soften, about 5 minutes. Using potato masher, lightly crush half of tomatoes. Return chicken to skillet. Reduce heat to medium-low. Simmer uncovered 5 minutes. Add remaining contents of bowl and simmer uncovered until chicken and sausages are cooked through, turning often, about 15 minutes longer. Place chicken and sausages on platter. Cut sausages on diagonal into thick slices. Stir basil into sauce. Season with salt and pepper. Spoon sauce over chicken.\nHeat 2 tablespoons oil in large nonstick skillet over medium-high heat. Sprinkle chicken with salt and pepper. Add chicken and sausages to skillet. Sauté until brown, 4 to 5 minutes per side. Transfer chicken and sausages to bowl.\nAdd mushrooms to skillet. Sauté until brown, about 4 minutes; add to same bowl. Add remaining 1 tablespoon oil to skillet; add tomatoes, red wine, garlic, and rosemary. Cover, reduce heat to medium, and cook until tomatoes soften, about 5 minutes. Using potato masher, lightly crush half of tomatoes. Return chicken to skillet. Reduce heat to medium-low. Simmer uncovered 5 minutes. Add remaining contents of bowl and simmer uncovered until chicken and sausages are cooked through, turning often, about 15 minutes longer.\nPlace chicken and sausages on platter. Cut sausages on diagonal into thick slices. Stir basil into sauce. Season with salt and pepper. Spoon sauce over chicken.",
    "title": "Chicken and Sausage Cacciatore with Grape Tomatoes "
  },
  "fbBd7pt42ZN3HTOwdyHTN8utmiX6SZG": {
    "ingredients": [
      "4 cups chicken broth",
      "3 carrots, cut crosswise into 1/4-inch slices",
      "3/4 pound red potatoes, quartered lengthwise and cut crosswise into 1/2-inch pieces",
      "2 large ribs of celery, cut crosswise into 1/2-inch pieces",
      "2 1/2 cups cubed cooked chicken (the meat from a 3-pound chicken)",
      "1 onion, chopped",
      "3/4 stick (6 tablespoons) unsalted butter",
      "6 tablespoons all-purpose flour",
      "1/4 teaspoon dried thyme, crumbled",
      "1/4 teaspoon freshly grated nutmeg, or to taste",
      "1/2 cup minced fresh parsley leaves",
      "1 1/3 cups all-purpose flour",
      "1 1/2 teaspoons double-acting baking powder",
      "1/2 teaspoon baking soda",
      "1/2 teaspoon salt",
      "2 tablespoons cold unsalted butter, cut into bits",
      "2 tablespoons cold vegetable shortening, cut into bits",
      "1/3 cup grated sharp Cheddar",
      "1 large egg",
      "about 1/3 cup buttermilk",
      "an egg wash made by beating 1 large egg yolk with 1 tablespoon milk"
    ],
    "picture_link": null,
    "instructions": "Make the filling: In a saucepan bring the broth to a boil, add the carrots, the potatoes, and the celery, and simmer the vegetables, uncovered, for 10 to 15 minutes, or until they are tender. Transfer the vegetables with a slotted spoon to a large bowl, reserving the broth, and add the chicken to the bowl. In another saucepan cook the onion in the butter over moderately low heat, stirring, until it is softened, add the flour, and cook the roux, stirring, for 3 minutes. Add 3 cups of the reserved broth in a stream, whisking, reserving any remaining broth for another use, and bring the mixture to a boil, whisking. Add the thyme and simmer the sauce, stirring occasionally, for 5 minutes. Stir in the nutmeg, the parsley, and salt and pepper to taste, pour the sauce over the chicken mixture, and stir the mixture gently until it is just combined. Transfer the mixture to a 2-quart shallow baking dish or divide it among four 2-cup shallow baking dishes. The filling may be made 1 day in advance and kept covered and chilled. Bring the mixture to room temperature before continuing with the recipe.\nIn a saucepan bring the broth to a boil, add the carrots, the potatoes, and the celery, and simmer the vegetables, uncovered, for 10 to 15 minutes, or until they are tender. Transfer the vegetables with a slotted spoon to a large bowl, reserving the broth, and add the chicken to the bowl. In another saucepan cook the onion in the butter over moderately low heat, stirring, until it is softened, add the flour, and cook the roux, stirring, for 3 minutes. Add 3 cups of the reserved broth in a stream, whisking, reserving any remaining broth for another use, and bring the mixture to a boil, whisking. Add the thyme and simmer the sauce, stirring occasionally, for 5 minutes. Stir in the nutmeg, the parsley, and salt and pepper to taste, pour the sauce over the chicken mixture, and stir the mixture gently until it is just combined. Transfer the mixture to a 2-quart shallow baking dish or divide it among four 2-cup shallow baking dishes. The filling may be made 1 day in advance and kept covered and chilled. Bring the mixture to room temperature before continuing with the recipe.\nMake the biscuit crust: Into a bowl sift together the flour, the baking powder, the baking soda, and the salt, add the butter and the shortening, and blend the mixture until it resembles meal. Add the Cheddar and toss the mixture. Into a liquid measuring cup break the egg, add enough of the buttermilk to measure a total of 1/2 cup, and beat the mixture with a fork. Add the egg mixture to the flour mixture, stirring until the mixture just forms a dough, gather the dough into a ball, and on a floured surface pat it out 1/2 inch thick. Cut out as many rounds as possible with a 2-inch fluted round cutter dipped in flour, gathering the scraps and patting the dough out again in the same manner. Arrange the rounds on the chicken mixture, brush the tops of the rounds with the egg wash, and prick the rounds with a fork. Bake the pie in the middle of a preheated 450°F. oven for 15 to 25 minutes, or until the biscuits are puffed and golden and the filling is bubbling.\nInto a bowl sift together the flour, the baking powder, the baking soda, and the salt, add the butter and the shortening, and blend the mixture until it resembles meal. Add the Cheddar and toss the mixture. Into a liquid measuring cup break the egg, add enough of the buttermilk to measure a total of 1/2 cup, and beat the mixture with a fork. Add the egg mixture to the flour mixture, stirring until the mixture just forms a dough, gather the dough into a ball, and on a floured surface pat it out 1/2 inch thick. Cut out as many rounds as possible with a 2-inch fluted round cutter dipped in flour, gathering the scraps and patting the dough out again in the same manner.\nArrange the rounds on the chicken mixture, brush the tops of the rounds with the egg wash, and prick the rounds with a fork. Bake the pie in the middle of a preheated 450°F. oven for 15 to 25 minutes, or until the biscuits are puffed and golden and the filling is bubbling.",
    "title": "1985 Chicken Pie with Biscuit Crust "
  },
  "gojD4rjkZjVZ27GZT8iji2Kca5Dlxoi": {
    "ingredients": [
      "10 red radishes, trimmed, unpeeled, quartered",
      "10 garlic cloves",
      "1 teaspoon whole black peppercorns",
      "2 cups distilled white vinegar",
      "1 teaspoon kosher salt",
      "1 teaspoon sugar"
    ],
    "picture_link": "yaVCcPVmKxuNxRCMG/3N48Rrw8DjXiG",
    "instructions": "Combine first 3 ingredients in a clean 1 quart glass jar. Add vinegar, salt, and sugar. Cover; shake until sugar and salt begin to dissolve. Refrigerate for at least 3 days, shaking once a day. DO AHEAD: Can be made 1 month ahead. (The flavor mellows the longer the mixture pickles.) Keep chilled.\nCombine first 3 ingredients in a clean 1 quart glass jar. Add vinegar, salt, and sugar. Cover; shake until sugar and salt begin to dissolve. Refrigerate for at least 3 days, shaking once a day. DO AHEAD: Can be made 1 month ahead. (The flavor mellows the longer the mixture pickles.) Keep chilled.",
    "title": "Pickled Radishes "
  },
  "KM.PK1CLhMZdksHLoAChyUv77I4tlp2": {
    "ingredients": [
      "1/2 cup pearl barley",
      "1 1/2 cups canned vegetable broth",
      "1 large poblano chili or green bell pepper",
      "1 small red bell pepper",
      "2 large plum tomatoes, seeded, chopped (about 1 cup)",
      "1 cup fresh corn kernels",
      "1/3 cup chopped fresh cilantro",
      "1/4 cup chopped green onions",
      "2 1/2 tablespoons fresh lime juice",
      "2 tablespoons olive oil",
      "Nonstick olive oil spray",
      "4 large portobello mushrooms, stemmed, dark gills scraped away",
      "24 large spinach leaves"
    ],
    "picture_link": null,
    "instructions": "Place barley in heavy large saucepan. Cook over medium heat until pale golden, shaking pan occasionally, about 10 minutes. Add broth to pan and bring to boil. Reduce heat to medium-low, cover and simmer until barley is tender and broth is absorbed, about 35 minutes. Uncover and let barley cool. Char poblano and red bell pepper over gas flame or in broiler until blackened on all sides. Enclose in paper bag and let stand 10 minutes. Peel, seed and dice poblano and red bell pepper. Place barley, poblano and red bell pepper in large bowl. Add tomatoes and next 5 ingredients; toss to blend. Season salad with salt and pepper. (Can be prepared 1 day ahead. Cover; refrigerate. Bring to room temperature before serving.) Prepare barbecue (medium-high heat). Spray mushrooms with nonstick spray; sprinkle with salt and pepper. Grill until cooked through, about 4 minutes per side. Transfer to work surface; slice thinly. Arrange 6 spinach leaves on each of 4 plates. Top with barley salad. Arrange 1 sliced mushroom alongside each salad. Serve while mushrooms are still warm.\nPlace barley in heavy large saucepan. Cook over medium heat until pale golden, shaking pan occasionally, about 10 minutes. Add broth to pan and bring to boil. Reduce heat to medium-low, cover and simmer until barley is tender and broth is absorbed, about 35 minutes. Uncover and let barley cool.\nChar poblano and red bell pepper over gas flame or in broiler until blackened on all sides. Enclose in paper bag and let stand 10 minutes. Peel, seed and dice poblano and red bell pepper.\nPlace barley, poblano and red bell pepper in large bowl. Add tomatoes and next 5 ingredients; toss to blend. Season salad with salt and pepper. (Can be prepared 1 day ahead. Cover; refrigerate. Bring to room temperature before serving.)\nPrepare barbecue (medium-high heat). Spray mushrooms with nonstick spray; sprinkle with salt and pepper. Grill until cooked through, about 4 minutes per side. Transfer to work surface; slice thinly.\nArrange 6 spinach leaves on each of 4 plates. Top with barley salad. Arrange 1 sliced mushroom alongside each salad. Serve while mushrooms are still warm.",
    "title": "Toasted Barley Salad with Red Bell Pepper, Corn and Grilled Portobello Mushrooms "
  },
  "G5/k09NoyXjxeAytpjU4p7GbiD.Jjbe": {
    "ingredients": [
      "1 (2- to 2 1/2-pound) kabocha squash",
      "2 tablespoons olive oil",
      "1/4 cup honey",
      "1 tablespoon fresh ginger, finely grated",
      "1/2 teaspoon kosher salt"
    ],
    "picture_link": null,
    "instructions": "Bring 8-quart pot of water to boil. Add squash and boil, uncovered, 2 1/2 minutes. Using tongs, flip squash over, then boil 2 1/2 minutes more. Drain and let cool. When squash is cool enough to handle, cut off top and bottom and remove skin with paring knife. Cut squash in half crosswise, scoop out seeds, and cut flesh into 1-inch chunks. In medium bowl, stir together squash, olive oil, honey, ginger, and salt. Transfer to steamer set over boiling water and steam until tender, about 15 minutes. Spoon onto large plate and serve.\nBring 8-quart pot of water to boil. Add squash and boil, uncovered, 2 1/2 minutes. Using tongs, flip squash over, then boil 2 1/2 minutes more. Drain and let cool.\nWhen squash is cool enough to handle, cut off top and bottom and remove skin with paring knife. Cut squash in half crosswise, scoop out seeds, and cut flesh into 1-inch chunks.\nIn medium bowl, stir together squash, olive oil, honey, ginger, and salt. Transfer to steamer set over boiling water and steam until tender, about 15 minutes. Spoon onto large plate and serve.",
    "title": "Steamed Kabocha Squash "
  },
  "mdzCKJuu24tgO0h12oNV2HL/BYbUcrS": {
    "ingredients": [
      "12 (1/2-inch-thick) slices brioche or firm white sandwich bread, crusts discarded",
      "16 jumbo shrimp, peeled, leaving tail fan attached, and deveined",
      "3/4 stick unsalted butter, softened",
      "2 tablespoons finely chopped dill",
      "1 tablespoon finely chopped shallot",
      "Equipment: 8 (2-ounce) ramekins or small ovenproof cups"
    ],
    "picture_link": "mik.FDZN5fvIxGHlWDetkaR083YRUpu",
    "instructions": "Preheat oven to 375°F with rack in middle. Cut bread into 24 (2- by 1-inch) rectangles, then bake in a 4-sided sheet pan, turning once or twice, until golden, 8 to 10 minutes. (Leave oven on.) Transfer to a rack to cool. Season shrimp with 1/4 teaspoon salt and 1/8 teaspoon pepper. Mash together butter, dill, shallot, and 1/4 teaspoon each of salt and pepper. Put a dab of dill butter in each ramekin, then put ramekins in sheet pan. Arrange 2 shrimp, with tails up and facing each other, in each ramekin. Spread remaining dill butter in ramekins and bake until shrimp are just cooked through, 20 to 25 minutes. Serve with toasts.\nPreheat oven to 375°F with rack in middle.\nCut bread into 24 (2- by 1-inch) rectangles, then bake in a 4-sided sheet pan, turning once or twice, until golden, 8 to 10 minutes. (Leave oven on.) Transfer to a rack to cool.\nSeason shrimp with 1/4 teaspoon salt and 1/8 teaspoon pepper. Mash together butter, dill, shallot, and 1/4 teaspoon each of salt and pepper. Put a dab of dill butter in each ramekin, then put ramekins in sheet pan. Arrange 2 shrimp, with tails up and facing each other, in each ramekin. Spread remaining dill butter in ramekins and bake until shrimp are just cooked through, 20 to 25 minutes. Serve with toasts.",
    "title": "Shrimp in Dill Butter "
  }
}